#!python3
# -*- coding:utf-8 -*-

import re # 정규표현식 모듈
import redis # Redis 모듈

# Compile Regex
times = re.compile(r'[0-9]+회차?|[0-9]+[차화부편]')
number = re.compile(r'[0-9]+|\b([이삼사오육칠팔구]?십)?[일이삼사오육칠팔구]\b|[이삼사오육칠팔구]?십|([열쉰]|(스물)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔))?((하나)|[둘셋넷]|(다섯)|(여섯)|(일곱)|(여덟)|(아홉))|[열쉰]|(스물)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔)|백')
percent = re.compile(r'[0-9]+((프로)|(퍼센트))|([이삼사오육칠팔구]?십)?[일이삼사오육칠팔구]\s*((프로)|(퍼센트))|[이삼사오육칠팔구]?십\s*((프로)|(퍼센트))')
ordinal = re.compile(r'[0-9]+번째|(([열쉰]|(스물)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔))?(\S+한|[첫두세네]|(다섯)|(여섯)|(일곱)|(여덟)|(아홉))|([열쉰]|(스무)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔))|백)\s*번째')
age = re.compile(r'[0-9]+[세살]|([이삼사오육칠팔구]?십)?[일이삼사오육칠팔구]\s*[세살]|[이삼사오육칠팔구]?십\s*[세살]|(([열쉰]|(스물)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔))?([한첫두세네]|(다섯)|(여섯)|(일곱)|(여덟)|(아홉))|([열쉰]|(스무)|(서른)|(마흔)|(예순)|(일흔)|(여든)|(아흔))|백)\s*살')
birthyear = re.compile(r'[0-9]{2,4}년도?생')
decade = re.compile(r'[0-9]+년대')
rank = re.compile(r'[0-9]+[등위]')
duration = re.compile(r'([0-9]+\s*(시간*\s*[0-9]*\s*분*\s*[0-9]*\s*초*\s*|년*\s*[0-9]*\s*개월*\s*[0-9]*\s*일*\s*|){1}|(일|이|삼|사|오|육|칠|팔|구|십)+\s*주일{1}\s*)(반|동안){0,1}')
length = re.compile(r'[0-9]+\s*(mm|밀리미터|cm|센티미터|m|미터|km|킬로미터|in|인치|ft|피트|yd|야드|ch|체인|fur|펄롱|mile|마일|寸|치|尺|자|間|간|町|정|里|리|海里|해리)')
area = re.compile(r'[0-9]+\s*(m²|제곱미터|a|아르|ha|헥타르|km²|제곱킬로미터|ft²|제곱피트|yd²|제곱야드|에이커|ac|제곱체인|퍼치|평방자|평|단|정)')
weight = re.compile(r'[0-9]+(mg|g|kg|t|kt|gr|oz|lb|돈|냥|근|관)')
volume = re.compile(r'[0-9]+\s*(cc|ml|mℓ|dℓ|dl|ℓ|l|cm3|m3|in3|ft3|yd3|gal|bbl|fl|oz|홉|되|말|섬)')
pressure = re.compile(r'[0-9]+\s*(atm|기압|Pa|파스칼|hPa|헥토파스칼|kPa|킬로파스칼|MPa|메가파스칼|dyne/cm²|mb|밀리바|bar|kgf/cm²|psi|mmHg|inchHg|mmH2O|inchH20)')
temparature = re.compile(r'(-*[0-9]+(도|°C|°c|°F|°f|K|k|°R|°r|°N|°n|°De|°R?|°Rø)|[영상|영하]*\s*[0-9]+도)')
speed = re.compile(r'(-*[0-9]+\s*((m\/s|m\/h|km\/s|km\/h|in\/s|in\/h|ft\/s|ft\/h|mi\/s|mi\/h|kn|mach)|((초속|분속|시속)*\s*[0-9]+\s*(미터|킬로미터|인치|피트|마일|센티미터|밀리미터|마하){1})))')
data = re.compile(r'[0-9]+\s*(bit|비트|bit|B|바이트|byte|KB|킬로바이트|kilobyte|KiB|키비바이트|kibybyte|MB|메가바이트|megabyte|MiB|메비바이트|mebibyte|GB|기가바이트|gigabyte|GiB|gibibyte|기비바이트|TB|테라바이트|terabyte|TiB|테비바이트|tebibyte|PB|페타바이트|petabyte|PiB|페비바이트|pebibyte|EB|엑사바이트|exabyte|EiB|엑비바이트|exbibyte|ZB|제타바이트|zettabyte|ZiB|제비바이트|zebibyte|YB|요타바이트|yottabyte|YiB|요비바이트|yobibyte)')
energy = re.compile(r'(요타|yotta|Y|제타|zetta|Z|엑사|exa|E|페타|peta|P|테라|tera|P|기가|giga|G|메가|mega|M|킬로|kilo|k|헥토|hecto|h|데카|deca|da|데시|deci|d|센티|centi|c|밀리|milli|m|마이크로|micro|μ|나노|nano|n|피코|pico|p|펨토|femto|f|아토|atto|a|젭토|zepto|z|욕토|yocto|y)*\s*[0-9]+\s*(헤르츠|Hz|J|줄|cal|칼로리|kcal|킬로칼로리|Btu|kw/hr|hp/hr|데시벨|dB|암페어|amp|A|마력|hp|ps){1}')
starsign = re.compile(r'(물병자리|물고기자리|양자리|황소자리|쌍둥이자리|게자리|사자자리|처녀자리|천칭자리|전갈자리|사수자리|궁수자리|염소자리)')
zodiac = re.compile(r'(쥐띠|소띠|호랑이띠|토끼띠|용띠|뱀띠|말띠|양띠|원숭이띠|닭띠|개띠|돼지띠)')
url = re.compile(r'((http|ftp|https)://([\w_-]+(?:(?:\.[\w_-]+)+))([\w.,@?^=%&:/~+#-]*[\w@?^=%&/~+#-])|([\w_-]+(?:(?:\.[\w_-]+)+))([\w.,@?^=%&:/~+#-]*[\w@?^=%&/~+#-])?)')
bussiness_number = re.compile(r'((?!02)\d{10}|\d{3}[-]\d{2}[-]\d{5}|\d{3}\s\d{2}\s\d{5})')
phone_number = re.compile(r'((?=02)\d{10}|\d{11,}|\d+[-]\d{3,}[-]\d{3,}|\d+[.]\d{3,}[.]\d{3,}|\d+\s[\d{3,}]+\s[\d{3,}]+)')
licenseplate_number = re.compile(r'\d{1,}[\s]*[가-힣][\s]*\d{4}') 
date = re.compile(
    r'(오늘|내일|모래|글피|어제|어저께|([다]*다음|저번|이번|지난|차|이번|이듬)(주|해)|(내[후]*|[제]*작)년)|[월화수목금토일]?요일|(([0-9]+년[\s])([0-9]+월[\s])|([0-9]+월[\s]))*[0-9]+일')
period = re.compile(r'(이번|지난|다음)주|(올해|(제)*작년|내(후)*년)|(주말|평일)|[0-9]+년([0-9]+월)*|[0-9]+월|[0-9]+(년|월|일)부터 [0-9]+(년|월|일)까지')
lunar = re.compile(r'(올해|[\S]*년)*[\s]*음력[\s]*([0-9]+년)*[\s]*([0-9]+월)*[\s]*([0-9]+일)*(설날|추석)*')
period_lunar = re.compile(r'음력[\s][1-12]?월')
time = re.compile(r'((오전|오후|밤|낮|[0-9]+(시|분))*[\s]*[0-9]+(시|분|초)|(정오|자정))[\s]*(뒤|후)*')
time_period = re.compile(r'(오전|아침|새벽|저녁|낮|밤)*[\s]*(오전|아침|새벽|저녁|낮|밤|([0-9]+시부터 [\S]*까지))')
date_time = re.compile(r'(내일|모레|오전|글피)\s(오전|오후)*\s?[0-9]+시|현재|[0-9]+월\s?[0-9]+일\s?(오전|오후|낮|밤|아침|점심|저녁|새벽)?\s?[0-9]+시')
date_time_period = re.compile(r'((오늘|내일|어[제|젯]|모레)|[0-9]+년[\s]*[0-9]+월[\s]*[0-9]일|[0-9]+년[\s]*[0-9]+월|[0-9]+년)[\s]*((오전|오후|낮|밤)|[0-9]+시부터[\s]*[0-9]+시[까지]*)')

# 정규표현식 entitiy_name, now_regex list
entity_list = [
['@sys.number.times', times],
['@sys.number', number],
['@sys.number.percent', percent],
['@sys.number.ordinal', ordinal],
['@sys.number.age', age],
['@sys.number.birthyear', birthyear],
['@sys.number.decade', decade],
['@sys.number.rank', rank],
['@sys.unit.duration', duration],
['@sys.unit.length', length],
['@sys.unit.area', area],
['@sys.unit.weight', weight],
['@sys.unit.volume', volume],
['@sys.unit.pressure', pressure],
['@sys.unit.temparature', temparature],
['@sys.unit.speed', speed],
['@sys.unit.data', data],
['@sys.unit.energy', energy],
['@sys.fortune.starsign', starsign],
['@sys.fortune.zodiac', zodiac],
['@sys.url', url],
['@sys.bussiness.number', bussiness_number],
['@sys.phone.number', phone_number],
['@sys.licenseplate.number', licenseplate_number],
['@sys.date', date],
['@sys.date.period', period],
['@sys.date.lunar', lunar],
['@sys.date.period.lunar', period_lunar],
['@sys.time', time],
['@sys.time.period', time_period],
['@sys.date.time', date_time],
['@sys.date.time.period', date_time_period]
]

class regex:
    def __init__(self, input_data):
        # 사용할 변수목록 (list ver.)
        self.sentence = input_data

        '''
        # 사용할 변수목록 (not list ver.)
        self.sentence = input_data
        self.entity_name = '@null'
        self.value = 'null'
        self.start_idx = -1
        self.end_idx = -1
        self.tagged_sentence = 'notfound'
        '''

        self.cnt = 0
        self.entity_name = []
        self.value = []
        self.start_idx = []
        self.end_idx = []
        self.tagged_sentence = ''
        self.total_idx = []

        # redis 서버 실행 후 DB 구축까지 과정
        self.connection = redis.StrictRedis(host='localhost', port = 6379, db = 0)
        # 레디스 DB 데이터 전체 삭제
        self.connection.flushdb()
        
        self.connection.rpush("@sys.city", "(아크라|리브르빌|조지타운|반줄|하갓냐|과테말라|세인트조지스|아테네|누크|코나크리|비사우|빈트후크|야렌|아부자|주바|프리토리아|블룸폰테인|케이프타운|츠힌발리|암스테르담|헤이그|카트만두|오슬로|웰링턴|알로피|니아메|마나과|서울특별시|서울|서울시|코펜하겐|로조|산토도밍고|베를린|딜리|비엔티안|몬로비아|리가|모스크바|베이루트|마세로|부쿠레슈티|룩셈부르크|키갈리|트리폴리|빌뉴스|파두츠|안타나나리보|마주로|스코페|릴롱궤|쿠알라룸푸르|푸트라자야|바마코|멕시코시티|모나코|라바트|포트루이스|누악쇼트|마푸투|포드고리차|키시너우|말레|발레타|울란바토르|워싱턴D.C.|워싱턴DC|워싱턴dc|워싱턴d.c.|네피도|팔리키르|포트빌라|마나마|브리지타운|바티칸|나소|다카|포르토노보|카라카스|하노이|브뤼쉘|민스크|벨모판|벨리즈시티|사라예보|가보로네|수크레|기테가|라파스|와가두구|팀푸|사이판섬|니코시아|소피아|브라질리아|반다르스리브가완|아피아|리야드|엘아이운|산마리노|상투메|호|다카르|베오그라드|빅토리아|캐스트리스|킹스타운|바스테르|모가디슈|하르게이사|호니아라|하르툼|피라마리보|스리자야와르데네푸라코테|스톡홀름|베른|마드리드|브라티슬라바|류블랴나|다마스쿠스|프리타운|싱가포르|아부다비|두바이|예레반|스테파나케르트|부에노스아이레스|레이캬비크|포르토프랭스|더블린|바쿠|카불|안도라라벨랴|티라나|알제|수후미|루안다|세인트존스|야스마라|음바바네|로밤바|탈린|키토|괴야킬|아디스아바바|산살바도르|런던|사나|무스카트|캔버라|빈|테구시갈파|암만|캄팔라|몬테비데오|타슈켄트|키이우|카디프|바그다드|테헤란|텔아비브|예루살렘|카이로|로마|뉴델리|뭄바이|자카르타|도쿄|보르네오섬 동부 칼리만탄|킹스턴|루사카|말라보|평양|트빌리시|방기|타이베이|베이징|지부티|웨스트사이드|히라레|은자메나|프라하|산티아고|야운데|프리이아|아스타나|도하|프놈펜|오타와|나이로비|모로니|프리슈티나|산호세|야무수크로|보고타|브라자빌|킨샤사|아바나|쿠웨이트시티|아바루아|자그레브|비슈케크|타라와|니코시아|두샨베|도도마|방콕|앙카라|로메|누쿠알로파|아슈하바트|푸나푸티|튀니스|티라스폴|포트오브스페인|파나마시티|아순시온|이슬라마바드|포트모르즈비|응게룰무드|라말라|예루살렘|리마|리스본|바르샤바|산후안|파리|수바|헬싱키|마닐라|부다페스트|캔버라)")
        self.connection.rpush("@sys.city", "(카라치|상하이|델리|라고스|이스탄불|도쿄|뭄바이|모스크바|상파울루|베이징|톈진|킨샤사|광저우|선전|카이로|자카르타|라호르|멕시코시티|방갈도르|뉴욕|런던|방콕|테헤란|동관시|다카|리마|호치민 시티|보고타|하노이|우한시|리우데자네이루|아마다바드|바그다드|산티아고|첸나이|앙카라|충칭|도쿄도 구부|요코하마시|오사카시|나고야시|삿포로시|후쿠오카|고베|가와사키|교토|사이타마|히로시마|센다이|지바|기타큐슈시|세타가야|사카이|나가타|하마마쓰시|구마모토|니가타|하마마쓰시|네리마|오카야마|오타구|시즈오카|에돡와|아다치|후나바시|가고시마|가와구치|하치오지|스기나미|이타바시|히메지|우쓰노미야|오이타|이차카와|마쓰도|가쓰시|마치다|나가사키|후지사와|도요타|아카마쓰시|기후시|가시와|히라카타|미야자키|도요나카|시나가와|오카자키|이치노미야|나가노|토론토|샌디에이고|퀘벡 시티|홍콩|시카고|브뤼헤|마드리드|아바나|두바이|예루살렘|에든러버|키토|취리히|쿠스코|상트페테르부르크|베를린|하노이|퀸즈타운|사니겔데아옌데|두브로브니크|산세바스티안|방콕|카르타헤나|더블린|마라케시|베르겐|자이푸르|베이징|아테네|더블린|뉴욕|로스앤젤레스|시카고|휴스턴|피닉스|필라델피아|샌안토니오|샌디에고|댈러스|산호세|오스틴|잭슨빌|포트워스|콜럼버스|인디애나폴리스|살럿|샌프란시스코|시애틀|덴버|내슈빌|오클라호마시티|엘패소|보스턴|포틀랜드|라스베이거스|디트로이트|멤피스|루이빌|볼티모어|밀워키|앨버커키|투손|프레즈노|새크라멘토|캔자스시티|메사|애틀란타|오마하|콜라도스프링스|롤리|롱비치|버지니아비치|마이애미|오클랜드|미니애폴리스|털사|베이커즈필드|위치토|알링턴|라리사|아테네|예데사|이라클리온|스파르타|코린토스|테베|테살로니키|나르던|델프트|로테르담|바를러나사우|암스테르담|하를럼|헤이그|라인덴|오슬로|코펜하겐|리가|세야||빌뉴스|카우나스|쿨라이페다|트라카이|파두츠|체티네|포드고리차|발레타|겐트|리에주|바를러헤르토크|브뤼셀|브뤼헤|안트베르펀|스코페|오흐리드|소피아|플로브디프|벨리코 타르노보|베오그라드|니시|노비사드|수보티차|말뫼|스톡홀름|예테보리|린셰핑|로카르노|바젤|베른|브베|제네바|취리히|그라나다|마드리드|말라가|무르시아|바다호스|바르셀로나|바야돌리드|발렌시아|부르고스|빌바오|사라고사|세비야|세우타|알메리아|알헤시라스|코르도바|타라고나|톨레도|팔마|팜플로나|헤타페|하혼|멜리야|살라망카|류블랴나|예레반|규므리|바나조르|에치미아진|레이캬비크|아퀴레이리|더블린|티라나|블로러|슈코더르|두러스|나르바|타르투|탈린|글래스고|뉴캐슬어폰타인|런던|런던데리|리버풀|맨체스터|미들즈브러|버밍엄|벨파스트|블랙번|선더랜드|셰필드|스완지|에든버러|카디프|커크월|포츠머스|지브롤터|빈|인스브루크|잘츠브루크|도네츠크|루한스크|르비우|세바스토폴|심페로폴|오데사|키이우|하르키우|체르니우치|우주호로드|나폴리|로마|밀라노|바리|베네치아|살레르노|소렌토|시라쿠사|제노바|토리노|팔레르모|페루자|폼페이|피렌체|므츠헤타|바투미트빌리시|체스키 크룸로프|프라하|두브로브니크|자그레브|니코시아|파마구스타|가지안텝|디야르바크르|리제|마르딘|반|샨르우르파|셀축|시노프|앙카라|이스탄불|이즈미르|카이세리|킬리스|콘야|트라브존|리스본|코임브라|파티마|포르투|그단스크|바르샤바|브로츠와프|슈제친|우치|크라쿠프|키엘체|포즈난|그르노블|낭시|낭트|니스|님|디종|라로셀|루앙|르아브르|랭스|리모주|리옹|릴|마르세유|몽펠리에|발랑스|보르도|블로뉴|비시|브장송|스트라스부르|파리|수아송|샤르트르|아를|아비뇽|아작시오|앙굴렘|오랑주|오를레앙|헬싱키|부다페스트|데브레첸|가오슝시|신베이|신주|자이|지룽|타이난|타이둥|타이베이|타이중|비엔티안|방비엥|루앙프라방|믈라카시|조호르바루|코타카나발루|쿠알룸푸르|라부안|스름반|캉아르|쿠안탄|이포|조지타운|코타바루|푸트라자야|프탈링자야|샤알람|수방자야|쿠칭|말레|울란바토르|에르데네트|처이발상|네피도|만달레이|바간|양곤|마나마|다카리야드|메카|제다|담맘|메디나|다마스쿠스|다라|라카|라타키아|데이르에조르|알레포|이들리브|타르투스|팔미라|하마|홈스|두바이|샤르자|라스 알카이마|아부다비|아지만|움 알쿠와인|푸자이라|카불|칸다하르|헤라트|사나|아덴|시밤|모카|무스카트|타슈켄트|시마르칸트|부하라|안디잔|우르겐치|코칸트|페르가나|히바|나자프|바그다드|바스라|모술|사마라|팔루자|부칸|테헤란|이스파한|쉬라즈|쿰|마슈하드|타브리즈|하마단|텔아비브|에일라트|하이파|샤르나트|뉴델리|다즐링|델리|레|뭄바이|바라나시|첸나이|콜카타|벵갈루루|자이푸르|파트나|러크나우|자카르타|덴파사르|메단|반둥|보고르|수라바야|아체|욕야카르타|쿠팡|팔렘방|아랄스크|아스타나|아티리우|약타우|악퇴베|알마티|오랄|외스케멘|세미팔라틴스크|쉼켄트|카라간다|코스타나이|쾩셰타우|크즐오르다|타라즈|파블로다르|페트로파블|방콕|파타야|치앙마이|후아힌|광저우|구이린|난징|단둥|마카오|상하이|쑤저우|샤먼|스자좡)")
        self.connection.rpush("@sys.state", "((바다흐산|바드기스주|바글란|발흐|바미안|다이쿤디|파라|파르야브|가즈니|구르|헬만드|헤라트|주즈잔|카불|칸다하르|카피사|호스트|쿠나르|쿤두즈|라그만|로가르|낭가르하르|남루즈|누리스탄|우루즈간|팍티야|팍티카|판지시르|파르반|사망간|사르이폴|타하르|바르다크|자불)주*)")
        self.connection.rpush("@sys.state", "((베라트|디버르|두러스|엘바산|피에르|지로카스터르|코르처|쿠커스|레저주슈코더르|티라나|블로러)주*)")
        self.connection.rpush("@sys.state", "((나미브|루안다|룬다노르트|룬다술|말란즈|모시쿠|벵겔라|벵구|비에|우암부|우이즈|우이르|자이르|카빈다|쿠네느|쿠안두쿠방구|쿠안자노르트|쿠안자술)주*)")## 앙골라self.connection.rpush("@sys.state", "((부에노스아이레스|카타마르카주|차코|추부트|코르도바|쿠리엔테스|엔트레리오스|포르모사|후후이|라팜파|라리오하|멘도사|미시오네스|네우켄|리오네그로|살타|산후안|산루이스|산타크루스|산타페|산티아고델에스테로|티에라델푸에고|투쿠만)주*)")## 아르헨티나
        self.connection.rpush("@sys.state", "((뉴사우스웨일스|퀸즐랜드|사우스오스트레일리아|태즈메이니아|빅토리아|웨스턴오스트레일리아|저비스베이|노던)주*)")##오스트레일리아
        self.connection.rpush("@sys.state", "((아이워|아나바르|아네탄|아니바레|바이티|보에|부아다|데니고모두|에와|이유브|메넹|니보크|우아보에|야렌)구*)")## 나우루
        self.connection.rpush("@sys.state", "((압셰론|아그자베디|아그담|아그다슈|아흐스타파|아흐수|시르반시|아스타라|바쿠|발라켄|베르데|베일레간|빌레수바르|제브라이을|젤릴라바트|아슈커센|퓌줄리|게데베이|간자시|고란보이|괴이차이|하즈가불|이미슐리|이스마이을르|켈베제르|퀴르데미르|라츤|렌케란|렌케란시|레리크|마살르|민게체비르|나프탈란|네프찰라|오구스|게벨레|가흐|가자흐|고부스탄|구바|구바들르|구사르|사틀르|사비라바트|샤브란|셰키|셰키시|살리안|샤마흐|솀키르|사무흐|시예젠|숨가이트|슈샤구|슈샤시|테르테르|토부스|우자르|하치마스|한켄디시|괴이괼|한라르|흐즈|호잘르|호자벤트|야르듬르|예블라흐|에블라흐시|젠길란|자가탈라|제르다프)주*)")## 아제르바이잔
        self.connection.rpush("@sys.state", "((우나사나|포사비나|투즐라|제니차도보이|보스니아포드리네|중앙보스니아|헤르체고비나네레트바|서헤르체고비나|사라예보|제10 )주*)")## 보스니아 헤르체코비나
        self.connection.rpush("@sys.state", "((바리살|치타공|다카|쿨나|마이멘싱|라지샤히|랑푸르|실렛)주*)")## 방글라데시
        self.connection.rpush("@sys.state", "((블라고에브그라드|부르가스|도브리치|가브로보|하스코보|커르잘리|큐스텐딜|로베치|몬타나|파자르지크|페르니크|플레벤|플로브디프|라즈그라드|루세|슈멘|실리스트라|슬리벤|스몰랸|소피아시|소피아|스타라자고라|터르고비슈테|바르나|벨리코터르노보|비딘|브라차|얌볼)주*)")## 불가리아
        self.connection.rpush("@sys.state", "((수도|무하라크|북부|남부)주*)")## 바레인
        self.connection.rpush("@sys.state", "((기테가|루몽게|루이기|루타나|마캄바|무람비야|무잉가|부루리|부반자|부줌부라 교외|부줌부라 도시|음와로|응고지|치키토케|카루지|카얀자|캉구조|키룬도)주*)")## 브룬디
        self.connection.rpush("@sys.state", "(( 블라잇|브루네이무아라|틈부롱|투통 )구*)")## 브루나이
        self.connection.rpush("@sys.state", "((베니|추키사카|코차밤바|라파스|오루로|판도|포토시|산타크루스|타리하)주*)")## 볼리비아
        self.connection.rpush("@sys.state", "((아크리|알라고아스|아마파|아마조나스|바이아|세아라|연방구|이스피리투산투|고이아스|마라냥|마투그로수|마투그로수두술|미나스제라이스|파라|파라이바|파라나|페르남부쿠|피아우이|리우데자네이루|히우그란지두노르치|히우그란지두술|혼도니아|호라이마|산타카타리나|상파울루|세르지피|토칸칭스)주*)")## 브라질
        self.connection.rpush("@sys.state", "(아바코 제도|센트럴아바코|그랜드케이|그린터틀케이|호프타운|무어스아일랜드|노스아바코|사우스아바코|아클린스섬|안드로스섬|센트럴안드로스|맹드로브케이|노스안드로스|아수스안드로스|베리제도|비미니|캣섬|크루커드섬|일루서라섬|센트럴일루서라|하버섬|노스일루서라|사우스일루서라|스패니시웰스|엑수마|블랙포인트|엑수마|그랜드바하마섬|이스트그랜드바하마|웨스트그랜드바하마|프리포트|이나과섬|롱섬|마야과나섬|뉴프로비던스섬|래기드섬|럼케이섬|산살바도르섬)")## 바하마
        self.connection.rpush("@sys.state", "((민스크|브레스트|호멜|흐로드나|마힐료우|민스크|비쳅스크)주*)")## 벨라루스
        self.connection.rpush("@sys.state", "((벨리즈|카요|코로살|오렌지워크|스탠크리크|털리도)구*)")## 벨리즈
        self.connection.rpush("@sys.state", "((온타리오|퀘백|노바스코샤|뉴브런즈윅|매니토바|브르티시컬럼비아|프린스에드워드아일랜드|서스캐처원|앨버타|뉴펀들랜드 래브라도|노스트웨스트|유콘|누나부트)주*)")## 캐나다
        self.connection.rpush("@sys.state", "((중앙콩고|쾅고|퀼루|마이은돔베|카사이|카사이상트랄|카사이오리앙탈|로마미|상쿠루|마니에마|남키부|북키부|이투리|오트우엘레|초포|바우엘레|북우방기|몽갈라|남우방기|에카퇴르|추아파|탕가니카|오트로마미|루알라바|오트카탕가)주*)")## 콩고 민주공화국
        self.connection.rpush("@sys.state", "(파두츠|샨|발처스|트리젠|에셴|마우렌|트리젠베르크|루겔|감프린|셸렌베르크|플랑켄)")## 리크텐슈타인
        self.connection.rpush("@sys.state", "(베른|취리히|루체른|우리|슈비츠|옵발덴|니트발덴|글라루스|추크|졸로투른|바젤슈타트|바젤란트|샤프하우젠|아펜첼아우서로덴|아펜첼이너로덴|장크트갈렌|아르가우|투르가우|그라우뷘덴|프리부르|발레|보|뇌샤텔|제네바|쥐라|티치노)")## 스위스
        self.connection.rpush("@sys.state", "((아라카이파리나코타|타라파카|안토파가스타|아타카마|코킴보|발파라이소|산티아고 수도|리베르타도르헤네랄베르 나르도오이긴스|마울레|비오비오|아라우카니아|로스리오스|로스라고스|아이센델헤네랄카를롤스 이바녜스델캄포|마가야녜스이데라안타르티카칠레나)주*)")## 칠레
        self.connection.rpush("@sys.state", "(신장위구르자치구|티베르트자치구|칭하이성|간쑤성|쓰촨성|원난성|닝샤후이족자치구|과이좡족자치구|구이저우성|충칭시|산시성|내몽골자치구|하이난성|광둥성|후난성|후베이성|산시성|허난성|장시성|푸젠성|저장성|안후이성|장쑤성|상둥성|허베이성|톈진시|베이징시|상하이시|랴오닝성|지린성|헤이룽장성)")## 중국
        self.connection.rpush("@sys.state", "((아마소나스|안티오키아|아라우카|아틀란티코|볼리바르|보야카|칼다스|카케타|카사나레|카우카|세사르|초코|코르도바|분디나마르카|과이니아|과비아레|우일라|라과히라|마그달레나|메타|나리뇨|노르테 데 산탄데르|푸투마요|킨디오|리사랄다|산안드레스 이 프로비덴시아|산탄데르|수크레|톨리마|바예델카우카|바우페스|비차다|보고타)주*)")## 콜롬비아
        self.connection.rpush("@sys.state", "((알라후엘라|카르타고|과나카스테|에레디아|리몬|푼타레나스|산호세)주*)")
        self.connection.rpush("@sys.state", "((피나르델리오|아르테미사|아바나|마야베케|마탄사스|시엔푸에고스|비야클라라|상크티스피리투스|시에고데아빌라|카마궤이|라스투나스|그란마|올긴|산티아고데쿠바|관타나모|후벤투드)주*)")## 쿠바
        self.connection.rpush("@sys.state", "((프라하|중앙보헤미아|남보헤미아|플젠|카를로비바리|우스티|리베레츠|흐라데츠크랄로베|파르두비체|올로모우츠|모라바슬레스코|남모라바|즐린|비소치나)주*)")## 체코
        self.connection.rpush("@sys.state", "((디킬|아르타|알리사비에|오보크|타주라)주*)")## 지부티
        self.connection.rpush("@sys.state", "((코펜하겐|프레데릭스베르|프레데릭스보르|로스킬레|베스트셸란|스토르스트룀|퓐스|쇠네르윌란|리베|바일레|링쾨빙|비보르|노르윌란|오르후스|보른홀름)주*)")## 덴마크 
        self.connection.rpush("@sys.state", "((아드라르|슐레프|라구아트|움엘부아기|바트나|베자이아|비스크라|베샤르|블리다|부이라|타만라세트|테베사|틀렘센|티아레|티지우주|알제|젤파|지젤|세티프|사이다|스킥다|시디벨아베스|안나바|겔마|콩스탕틴|메데아|모스타가넴|음실라|마스카라|우아르글라|오랑|엘바야드|일리지|보르즈부아레리즈|부메르데스|엘타르프|틴두프|티셈실트|엘우에드|켄셸라|수크아라스|티파자|밀라|아인데플라|나마|아인테무셴트|가르다이아|렐리잔)주*)")## 알제리아
        self.connection.rpush("@sys.state", "((알렉산드리아|아스완|아시우트|베헤이라|베니수에프|카이로|다칼리야|다미에타|파이윰|가르비야|기자|이스마일리아|카프르엘셰이크|마트루|마니아|무누피아|알와디알자디드|자누브시나|포트사이드|칼리우비야|케나|홍해|샤르키야|소하그|샤말시나|수에즈|룩소르)주*)")## 이집트
        self.connection.rpush("@sys.state", "((중앙|마에켈|나부|데부브|가시바르카|안세바|북홍해|세미에나위케이바리|남홍해|데부바위케이바리)주*)")## 에리트레아
        self.connection.rpush("@sys.state", "(아디스아바바|아파르주|암하라주|베니샹굴구무즈주|디레다와|감벨라주|하라리주|오로미아주|소말리주|남부국민민족인민주|티그레주)")## 에티오피아
        self.connection.rpush("@sys.state", "((부르겐란트|케른텐|니더외스터라이히|오버외스터라이히|잘츠부르크|슈타이어마르크|티롤|포어아를베르크|빈)주*)")## 오스트리아
        self.connection.rpush("@sys.state", "((나뮈르|뤽상부르|리에주|베스트플란데런|안트베르펜|에노|오스트플란데런)주*)")## 벨기에
        self.connection.rpush("@sys.state", "((하리우|히우|이다비루|얘르바|여게바|래네|래네비루|펄바|패르누|라플라|사레|타르투|발가|빌리안디|버루)주*)")## 에스토니아
        self.connection.rpush("@sys.state", "((남핀란드|서핀란드|동핀란드|오울루|라피|올란드 자치)주*)")## 핀란드
        self.connection.rpush("@sys.state", "((가르|과들루프|노르|니에브르|도르도뉴|되세브르|두|드롬|랑드|레위니옹|로제르|로트에가론|로트|론|루아레|루아르아틀랑티크|루아르에셰르|루아르|마르티니크|마른|마옌|마요트|망슈주|멘에루아르|모르비앙|모젤|뫼르트에모젤|뫼즈|바랭|바르|발두아즈|발드마른|방데|보주|보클뤼즈|부슈뒤론|비엔|사르트|사부아|샤랑트마리팀|샤랑트|센마리팀|센생드니|센에마른|셰르|손에루아르|솜|아르데슈|아르덴|아리에주|아베롱|알리에|알프드오트프로방스|알프마리팀|앵드르에루아르|앵드르|앵|에로|에손|엔|오드센|오드|오랭|오른|오브|오트가론|오트루아르|오트마른|오트비엔|오트사부아|오트손|오트잘프|오트코르스|오트피레네|외르에루아르|외르|욘|우아즈|이블린|이제르|일에빌렌|제르|쥐라|지롱드|카라도스|캉탈|코레즈|코르스뒤쉬드|코트다르모르|코트도르|크뢰즈|타른에가론|타른|테리투아르드벨포르|파드칼레|파리|퓌드돔|피니스테르|피레네자톨랑티크|피레네조리앙탈)주*)")## 프랑스
        self.connection.rpush("@sys.state", "(바덴뷔르템베르크주|바이에른 자유주|베를린|브란덴부르크주|브레멘|함부르크|헤센주|메클렌부르크포어포메른주|니더작센주|노르트라인베스트팔렌주|라인란트팔츠주|자를란트주|작센 자유주|작센안할트주|슐레스비히홀슈타인주|튀링엔 자유주)")## 독일
        self.connection.rpush("@sys.state", "((아티키|중앙그리스|중앙마케도니아|크레타|동마케도니아 트라키|이피로스|이오니아 제도|북에게|펠로폰네소스|남에게|테살리아|서그리스|서마케도니아)주*)")## 그리스
        self.connection.rpush("@sys.state", "((더블린|위클로|웩스퍼드|칼로|킬데어|미스|라우스|모나한|캐번|롱퍼드|웨스트미스|오펄리|레이시|킬케니|워터퍼드|코크|케리|리머릭|티퍼레리|노스티퍼레리|사우스티퍼레리|클래어|골웨이|메이|로스커먼|슬라이고|리트림|더니골|퍼매나|티론|런던데리|앤트림|다운|아마)주*)")## 아일랜드
        self.connection.rpush("@sys.state", "((롬바르디아|라치오|캄파니아|베네토|시칠리아|에밀리아로마냐|피에몬테|풀리아|토스카나|칼라브리아|사르데냐|리구리아|마르케|아브루초|프리울리베네치아 줄리아|트렌티노알토 아디제|움브리아|바실리카타|몰리세|발레 다오스타)주*)")## 이탈리아
        self.connection.rpush("@sys.state", "((클라이페다|텔샤이|샤울랴이|타우라게|마리얌폴레|카우나스|알리투스|파네베지스|우테나|빌뉴스)주*)")## 리투아니아
        self.connection.rpush("@sys.state", "((클레르보|디키르히|레당주|비앙덴|빌츠|에히터나흐|그레벤마허|레미히|카펠렌|에슈쉬르알제트|룩셈부르크|메르슈)주*)")## 룩셈부르크
        self.connection.rpush("@sys.state", "((안드리예비차|바르|베라네|비옐로폴레|부드바|체티네|다닐로브그라드|헤르체그노비|콜라신|코토르|모이코바츠|닉시치|플라브|플루지네|플레블라|프드고리차|로자예|샤브니크|티바트|울친|자블라크)주*)")## 몬테네그로
        self.connection.rpush("@sys.state", "((노르트브라반트|노르트홀란트|드렌터|림뷔르흐|오버레이설|위트레흐트|자위트홀란트|제일란트|프리슬란트|플레볼란트|헬데를란트|흐로닝언)주*)")## 네덜란드
        self.connection.rpush("@sys.state", "((리스보아|레이리아|산타렝|세투발|베자|파루|에보라|포르탈레그르|카스텔루브랑쿠|구아르다|코임브라|아베이루|비제우|브라간사|빌라헤알|포르투|브라가|비아나두카스텔루|아소르스|마데이라)주*)")## 포르투갈
        self.connection.rpush("@sys.state", "((브라티슬라바|트르나바|트렌친|니트라|질리나|반스카비스트리차|프레쇼우|코시체)주*)")## 슬로바키아
        self.connection.rpush("@sys.state", "(프리므르스카|크란스카|고렌스카|노트란스카|돌렌스카|라크라이나|코로슈카|슈타예르스카|프레크무레)")## 슬로베니아
        self.connection.rpush("@sys.state", "(알메리아|카디스|코르도바|그라나다|우엘바|하엔|말라가|세비야|우에스카|테루엘|사라고사|아스투리아스|발레아레스 제도|알라바|기푸스코아|비스카야|산타 크루스 데 테네리페|라스 팔마스|칸타브리아|알바세테|쿠엥카|시우다드 레알|괴달라하라|톨레도|아빌라|부르고스|레온|팔렌시아|세고비아|살라망카|소리아|바야돌리드|사모라|바르셀로나|히로나|예이다|타라고나|바다호스|카세레스|라 코루냐|루고|오렌세|폰테베드라|라 리오하|마드리드|나바라|알리칸테|카스테욘|발렌시아|무르시아)")## 스페인
        self.connection.rpush("@sys.state", "((나모시|나이타시리|난드로가나보사|다카운드로베|라우|라|레와|로마이비치|마두아타|바|부아|세루아|칸다부|타일레부)주*)")## 피지
        self.connection.rpush("@sys.state", "((그레이터맨체스터|머지사이드|사우스요크셔|웨스크미들렌즈|웨스트요크|타인 위어|글로스터셔|노샘프턴셔|노스요크셔|노팅엄셔|노퍽|더피셔|데번|도싯|랭커셔|레스터셔|링컨셔|버크셔|버킹엄셔|서리|서머싯|서퍽|스태퍼드셔|에식스|옥스퍼드셔|웅스터셔|워릭셔|웨스트서식스|이스트서식스|컴브리아|케임브리지셔|켄트|하트퍼드셔|햄프셔|노섬벌랜드|더럼|러틀랜드|베드퍼드셔|시티오브런던|브리스틀|슈롭셔|아일오브와이트|월트셔|이스트라이딩오브요크셔|체셔|콘월|헤리퍼드|그레이터런던)주*)")## 잉글랜드
        self.connection.rpush("@sys.state", "(에버딘|애버딘셔|앵거스|아가일 뷰트|클라크매넌셔|덤프리스 갤러웨이|던디|이스트에어셔|이스트던바턴셔|이스트로디언|이스트렌프루셔|에든버러|폴커크|파이프|글래스고|하일랜드|인버클라이드|미들로디언|머리|노스래너크셔|노스에어셔|퍼스 킨로|렌프루셔|스코티시보더스|사우스에서셔|사우스래너크셔|스털링|웨스트던바턴셔|웨스트로디언|아우터헤브리디스|오크니 제도|셰틀랜드 제도)")## 스코틀랜드
        self.connection.rpush("@sys.state", "((권트|귀네드|글러모건|더베드|미드글러모건|사우스글러모건|웨스트글러모건|클루이드|포이스)주*)")## 웨일스
        self.connection.rpush("@sys.state", "((구리아|라차레치후미크베모스바네티|므츠헤타므티아네티|사메그렐로제모스바네티|삼츠헤자바헤티|시다카르틀리|이메레티|카헤티|크베모카르틀리)주*)")## 조지아
        self.connection.rpush("@sys.state", "((그레이터아크라|동부|볼타|북부|브롱아하포|서부|아샨티|어퍼웨스트|어퍼이스트|중앙)주*)")## 가나
        self.connection.rpush("@sys.state", "((중부|코퍼벨트|동부|루아폴라|루사카|무칭가|북부|북서부|남부|서부)주*)")## 잠비아
        self.connection.rpush("@sys.state", "((라베|마무|보케|은제레코레|캉칸|코나크리|킨디아|파라나)주*)")## 기니아
        self.connection.rpush("@sys.state", "((알타베라파스|바하베라파스|치말테낭고|치키물라|페텐|엘프로그레소|키체|에스쿠안틀라|과테말라|우에우에테낭고|이사발|할라파|후티아파|케트살테낭고|레탈룰레우|사카테페케스|산마르코스|산타로사|솔롤라|수치테페케스|토토니카판|시카파)주*)")## 과테말라
        self.connection.rpush("@sys.state", "(홍콩성|중사이구|중석수|완자이구|만자구|동구|둥구|남구|구룡|야우짐웡구|유첨왕구|삼서이보구|심수부구|가우룽싱구|구룡성구|웡다이신구|황대선구|군통구|관당구|콰이칭|규청구|췬완구|전만구|튄문구|둔문구|원롱구|원랑구|박구|복구다이보구|대포구|사틴구|사전구|사이궁구|서공구|레이도구|이도구)")## 홍콩
        self.connection.rpush("@sys.state", "((그라시아스아디오스|라파스|렘피라|바예|산타바르바라|아틀란티다|엘라파라이소|오코테페케|올란초|요로|이슬라스데라바이아|인티부카|촐루테카|코르테스|코마야과|코판|콜론|프란시스코모라산)주*)")## 온두라스
        self.connection.rpush("@sys.state", "((두브로브니크네레트바|리카센|메지무레|바라주단|벨로바르빌로고라|부코바르스리옘|브로드포사비나|비로비티차포드라비나|스플리트달마티아|시베니크크닌|시사크모슬라비나|오시예크바라냐|이스트라|자그레브|자다르|카를로바츠|코프리브니차크리제브치|크라피나자고레|포제가스라보니아|프리모레고르스키코타르)주*)")## 크로아티아
        self.connection.rpush("@sys.state", "((그라당스|남동부|남부|니프|북동부|북부|북서부|서부|아르티보니트|중앙)주*)")## 아이티
        self.connection.rpush("@sys.state", "((노그라드|바치키슈쿤|버러녀|버시|베스프렘|베케시|보르쇼드어버우이젬플렌|서볼치서트마르베레|쇼모지|야스너지쿤솔노크|절러|죄르모숀쇼프론|촌그라드처나드|코마롬에스테르곰|톨너|페슈트|페예르|허이두비허르|헤베시)주*)")## 헝가리
        self.connection.rpush("@sys.state", "((고론탈로|남수마트라|남술라웨시|남칼리만탄|남파푸아|동남술라웨시|동누사틍가라|동자와|동칼리만탄|람풍|루부클링가|리아우 제도|리아우|말루쿠|반텐|발리|방카블리통|북말루쿠|복수마트라|복술라웨시|북칼리만탄|붕쿨루|서누사틍가라|서수마트라|서술라웨시|서자와|서칼리만탄|서파푸아|아체|욕야카르타 특별|자카르타|잠비|중앙술라웨시|중앙자와|중앙칼리만탄|중앙파푸아|파우아고원|파푸아)주*)")## 인도네시아
        self.connection.rpush("@sys.state", "((텔아비브|하이파|예루살렘|중부|북부|남부|유대 사마리아)구*)")## 이스라엘
        self.connection.rpush("@sys.state", "(하리아나|히마찰프라데시|펀자브|라자스탄|찬디가르|잠무카슈미르|라다크|델리 연방 수도구역|차티스가르|마디아프라데시|우타르프라데시|우타라칸드|비하르|자르칸드|오디샤|서뱅골|아루나찰프라데시|아삼|마니푸르|메갈라야|미조람|니갈랜드|시킴|트리푸라|고아|구자라트|마하라슈트라|다드라나가르하벨리다만디우|안드라프라데시|카르나타카|케랄라|타밀나두|텔랑가나|안다만니코바르 제도|락샤드위프|푸두체리)")## 인도
        self.connection.rpush("@sys.state", "((나자프|니니와|다후크|디얄라|디카르|마이산|무탄나|바그다드|바빌|바스라|살라딘|술라이마니야|아르빌|안바르|와시트|카디시야|카르발라|키르쿠크|할라브자)주*)")## 이라크
        self.connection.rpush("@sys.state", "((테헤란|곰|마르카지|카즈빈|길란|아르다빌|잔잔|동아제르바이잔|서아제르바이잔|코르데스탄|하마단|케르만샤|일람|로레스탄|후제스탄|차하르마할에바흐티아리|코길루예부예르아마드|부셰르|파르스|호르모즈간|시스탄오발루체스탄|케르만|야즈드|이스파한|셈난|마잔다란|골레스탄|북호라산|호라산에라지비|남호라산|알보르즈)주*)")## 이란
        self.connection.rpush("@sys.state", "(미들섹스주|서리주|콘월주)")## 자메이카
        self.connection.rpush("@sys.state", "((아질룬|암만|아카바|발카|이르비드|제라시|카라크|마안|마다바|마프라크|타필라|자르카)주*)")## 요르단
        self.connection.rpush("@sys.state", "(훗카이도|아오모리현|이와테현|미야기현|아키타현|야마가타현|후쿠시마현|이바라키현|도치기현|군마현|사이타마현|지바현|도쿄도|가나가와현|니가타현|도야마현|이시카와현|후쿠이현|야마나시현|나가노현|기후현|시즈오카현|아이치현|미에현|시가현|교토부|오사카부|효고현|나라현|와카야마현|돗토리현|시마네현|오카야마현|히로시마현|야마구치현|도쿠시마현|가가와현|에히메현|고치현|후쿠오카현|사가현|나가사키현|구마모토현|오이타현|미야자키현|가고시마현|오키나와현)")## 일본
        self.connection.rpush("@sys.state", "((나이로비|니안자|오부|리프트밸리|북동부|서부|중부|해안)주*)")## 케냐
        self.connection.rpush("@sys.state", "((비슈케크|밧켄|추이|잘랄아바트|나린|오시|탈라스|이식쿨|오시)주*)")## 키르키스탄
        self.connection.rpush("@sys.state", "(라선특별시|함경북도|랑강도|함경남도|자강도|평안북도|평안남도|평향직할시|남포특별시|황해남도|황해북도|강원도|개성특별시|금강산국제관광특구)")## 북한
        self.connection.rpush("@sys.state", "((알아마디|수도|알파르와니야|알자라|하왈리|무바라크알카비르)주*)")## 쿠웨이트
        self.connection.rpush("@sys.state", "((알마티|아크몰라|악퇴베|아스타나|아티라우|바이코누르|동카자흐스탄|망기스타우|북카자흐스탄|파블로다르|카라간다|코스타나이|키질로르다|남카자흐스탄|서카자흐스탄|잠빌)주*)")## 카자흐스탄
        self.connection.rpush("@sys.state", "((루앙남타|루앙파방|보깨오|볼리캄사이|사이냐불리|사완나켓|사랄완|사이솜분|세꽁|시앙쾅|앗따쁘주|우돔사이주|비엔티안주|비엔티안부|짬빠삭|캄무안|풍살리|후아판)주*)")## 라오스
        self.connection.rpush("@sys.state", "((아카르|바알베크헤르멜|베이루트|베카|레바논산|나바티예|남부|북부)주*)")## 레바논
        self.connection.rpush("@sys.state", "((북부|북중부|북서부|중부|우바|동부|사바라가무와|서부|남부)주*)")## 스리랑카
        self.connection.rpush("@sys.state", "((보미|봉|바르폴루|그랜드바사|그랜드케이프마운트|그랜드게데|그랜드크루|로파|마르지비|메릴랜드|몽세라도|남바|리버세스|리버지|시노에)주*)")## 리베리아
        self.connection.rpush("@sys.state", "((부트난|데르나|자발알아크다르|마르지|벵가|알아화트|쿠프라|시르테|미스라타|무르쿠브|타라불루스|지파라|자위야|누카트알함스|자발알가르비|날루트|주프라|와디알샤티|세바|와디알하야|가트|무르주크)주*)")## 리비아
        self.connection.rpush("@sys.state", "(마궤도|만덜레도|버고도|저가잉도|안군도|에야워디도|떠닝따이도|여카잉주|몬주|샨주|친주|꺼야주|꺼인주|꺼친주)")## 미얀마
        self.connection.rpush("@sys.state", "((아르항가이|비양울기|바양헝거르|볼강|다르항올|더르너드|더르너고비|돈드고비|고비알타이|고비숨베르|헹티|허브드|후브스굴|우므느고비|오르홍|우부르항가이|겔렝게|수흐바타르|투브|오브스|자브항)주*)")## 몽골
        self.connection.rpush("@sys.state", "((노사세뇨라드파티마 당구|산투안토니우 당구|세 당구|상라자루 당구|상로렌수 당구|파티마 당구|화디마 당구|화왕 당구|성안둬니 당구|디 당구|왕더 당구|성라오렁쭤 당구|펑순 당구|마카오 낙도|노사세뇨라두카르무 당구|자무 당구|상프란시스쿠샤비에르 당구|성팡지거 당구|코타이)주*)")## 마카오
        self.connection.rpush("@sys.state", "((고르골|기디마카|남누악쇼트|누악쇼|다클레트누아디부|북누악쇼트|브라크나|서누악쇼트|아드라르|아사바|인시리|타간트|트라르자|티리스젬무르|호드에슈샤르기|호드엘가르비)주*)")## 모리타니
        self.connection.rpush("@sys.state", "(리비에르누아르구|플라크구|그랑포르구|모카구|팜플레무스구|플랭윌렐름구|포트루이스구|리비에르뒤랑파르구|사반구|아갈레가 제도|카르가도스 카라호스 제도|로드리게스섬|트로믈랭섬|차고스 제도)")## 모리셔스
        self.connection.rpush("@sys.state", "((아과스칼라엔테스|바하칼리포르니아|바하칼리포르니아수르|캄페체|치아파스|치와와|코아우일라|콜리마|두랑고|과나후아토|게레로|이달고|할리스코|멕시코|미초아칸|모렐로스|니야리트|누에보레온|오아하카|푸에블라|케레타로|킨타나로우|산루이스포토시|시날로아|소노라|타바스코|타마울리파스|틀락스칼라|베라크루스|유카탄|사카테카스)주*)")## 멕시코
        self.connection.rpush("@sys.state", "(쿠알라룸푸르 시정국|북쿠칭 시정국|코타키나발루 시정국|이포 시정청|남쿠칭 시정청|조호르바루 시정청|믈라카 역사적인 시정청|샤알람 시정청|알로르스타르 시정청|미리 시정청|프탈링자야 시정청|쿠알라트렝가누 시정청|헤낭섬 시정청|이스칸다르 푸트리 시정청|세베랑 페라이 시정청|스름반 시정청|수방자야 시정청)")## 말레이시아
        self.connection.rpush("@sys.state", "((가자|남풀라|니아스|마니카|마푸투|소팔라|이냠바느|잠베지아|카부델가두|테트)주*)")## 모잠비크
        self.connection.rpush("@sys.state", "((잠베지|에롱고|하르다프|카라스|동카방고|서카방고|호마스|쿠네네|오항궤나|오마헤케|오무사티|오샤나|오시코토|오초존주파)주*)")## 나미비아
        self.connection.rpush("@sys.state", "((아비아|아댜마와|아콰이봄|아남브라|바우치|바이엘사|베누에|보르노|크로스리버|델타|에보니|에도|에키티|에누구|곰베|이모|지가와|카두나|카노|카치나|케비|코기|콰라|라고스|나사라와|나이저|오군|온도|오순|오요|플래토|리버스|소코토|타라바|요베|잠파라)주*)")## 나이지리아 
        self.connection.rpush("@sys.state", "((보아코|카라소|치난데가|촌탈레스|에스텔리|그라나다|히노테가|레온|마드리스|마나과|마사야|마타갈파|누에바세고비아|리바스|리오산후안|북아틀란티코 자치구|남아틀란티코 자치구)주*)")## 니카라과
        self.connection.rpush("@sys.state", "((외스트폴|아케르스후스|부스케루|오슬로|헤드마르크|오플란|베스트폴|텔레마르크|에우스트아그데르|베스트아그데르|로갈란|호르달란|송노피오라네|뫼레오그롬스달|노를란|트롬스|핀마르크|트뢰넬라그)주*)")## 노르웨이
        self.connection.rpush("@sys.state", "((제1|제2|바그마티|간다키|룸비니|카르날리|수두르파슈침)주*)")## 네팔
        self.connection.rpush("@sys.state", "(사우스랜드|오타고|캔터베리|웨스트코스트|타스먼|말버러|넬슨|웰링턴|마너와투와거누이|타라나키|호크스베이|와이카토|기즈번|베이오프플렌티|오클랜드|노스랜드)")## 뉴질랜드
        self.connection.rpush("@sys.state", "((보카스델로토로|치리키|코클레|콜론|다리엔|에레라|로스산토스|베라과스)주*)")## 파나마
        self.connection.rpush("@sys.state", "((툼베스|로레토|피우라|카하마르카|아마소나스|라리베르타드|람마예케|산마르틴|리마|파스코|양카시|우아누코|후닌|우카얄리|리마|카야오|이카|아레키파|아야쿠초|아푸리막|쿠스코|우앙카벨리카|마드레데디오스|모케과|푸노|타크나)주*)")## 페루
        self.connection.rpush("@sys.state", "((중앙|걸프|밀른베이|오로|서부|헬라|지와카|부건빌 자치|동뉴브리튼|마누스|뉴아일랜드|서뉴브리튼|동세픽|마당|모로베|산다운|심부|이스턴하일랜드|엥가|서던하일랜드|웨스터하일랜드)주*)")## 파푸아뉴기니
        self.connection.rpush("@sys.state", "((아브라|북아구산|남아구산|아클란|알바이|안티케|아파야오|아우로라|바실란|바탄|바타네스|바탕가스|벵게트|빌리란|보홀|부티드논|불라칸|카가얀|북카마리네스|남카마리네스|카미긴|카탄두아네스|카비테|세부|콤포스텔라밸리|코타바토|북다바오|남다바오|서다바오|동다바오|디나가트 제도|동사마르|기마라스|이푸가오|북일로코스|남일로코스|일로일로|이사벨라|칼링가|라우니온|라구나|북라나오|남라나오|레이터|마긴다나오|마린두케|마스바테|서미사미스|동미사미스|마운티|서네그로스|동네그로스|북사마르|누에바에시하|누에바비스카야|서민도로|동민도로|팔라완|팜팡가|팡가시난|케손|키리노|리살|롬블론|사마르|사랑가니|시키호르|소르소곤|남코타바토|남레이테|술탄구다라트|술루|북수리가오|남수리가오|타를라크|타위타위|삼발레스|북삼보양가|남삼보양가|삼보앙가시부가이)주*)")## 필리핀
        self.connection.rpush("@sys.state", "((발루치스탄|카이베르파크툰크와|펀자브|신드|이슬라마바드 수도권|아자드 카슈미르|길기트발티스탄)주*)")## 파키스탄
        self.connection.rpush("@sys.state", "((서포모제|포모제|쿠야비포모제|비엘코폴스카|루부시|돌니실롱스크|오폴레|우치|실롱스크|마워폴스카|포드카르파츠키에|루블린|시비엥토크시스키에|바조프셰|포들라스키에|바르미아마주리)주*)")## 폴란드
        self.connection.rpush("@sys.state", "((알토파라과이|알토파라나|아맘바이|아순시온|보케론|카과수|카사파|카닌데유|센트랄|콘셉시온|코르디예라|과이라|이타푸아|미시오네스|녬부쿠|파라과리|프레시덴테아예스|산페드로)주*)")## 파라과이
        self.connection.rpush("@sys.state", "(아시샤말|알코르|움사랄|알다옌|알라이얀|도하|알와크라)")## 카타르
        self.connection.rpush("@sys.state", "((알바|아라드|아르제슈|바커우|비호르|비스트리차너서우드|브라쇼브|브러일라|부저우|카라슈세베린|컬러라시|클루지|콘스탄차|코바스나|듬보비차|돌지|갈라치|지우르지우|고르지|하르기타|후네도아라|이알로미차|이아시|일포브|마라무레슈|메헤딘치|무레슈|네암츠|울트|프라호바|사투마레|설라지|시비우|수체아바|텔레오르만|티미슈|톨체아|바슬루이|볼체아|브란체아|부쿠레슈티)주*)")## 루마니아
        self.connection.rpush("@sys.state", "((아무르|아르한겔스크|아스트라한|벨고로드|브랸스크|첼랴빈스크|이르쿠츠크|이바노보|칼리닌그라드|칼루가|케메로보|키로프|코스트로마|쿠르간|쿠르스크|레닌그라드|리페츠크|마가단|모스크바|무르만스크|니즈니노브고로드|노브고로드|노보시비르스크|옴스크|오렌부르크|오룔|펜자|프스코프|로스토프|랴잔|사할린|사마라|사라토프|스몰렌스크|스베르들롭스크|탐보프|톰스크|트베리|툴라|튜멘|울리야놉스크|블라디미르|볼고그라드|볼로그다|보로네시|야로슬라블)주*)")## 러시아
        self.connection.rpush("@sys.state", "((남부주|동부주|북부|서부주|키갈리)주*)")## 르완다
        self.connection.rpush("@sys.state", "((바하|북부 변경|자우프|마디나|카심|리야드|동부|아시르|하일|지잔|마카|나지란|타부크)주*)")## 사우디아라비아
        self.connection.rpush("@sys.state", "((중부|슈아절|과달카날|이사벨|마키라울라와|말레이타|렌넬벨로나|테모투|서부)주*)")## 솔로몬 제도
        self.connection.rpush("@sys.state", "((하르툼|북쿠르두판|북부|카살라|청나일|부다르푸르|남다르푸르|남쿠르두판|알자지라|백아리|나일|홍해|알카디리프|센나르|서다르푸르|중앙다르푸르|동다르푸르|서쿠르두판)주*)")## 수단
        self.connection.rpush("@sys.state", "((노르보텐|베스테릅텐|엠틀란드|베스테르노틀란드|에블레보리|달라르나|웁살라|베스트만란드|외레브로|베름란드|베스트라예탈란드|외스테르예틀란드|쇠데르만란드|스톡홀름|할란드|옌셰핑|칼마르|고틀란드|블레킹에|크로노베리|스코네)주*)")## 스웨덴
        self.connection.rpush("@sys.state", "((아우달|바콜|바나디르|바리|바이|갈구두드|게도|히란|주바다데헤|주바다호세|무두그|누갈|사나그|샤벨라하데헤|샤벨라하호세|솔|토그데르|워코이갈베드)주*)")## 소말리아
        self.connection.rpush("@sys.state", "((다마스쿠스|리프디마슈크|쿠네이트라|다라|수와이다|홈스|타르투스|라타키아|하마|이들리브|알레포|락까|데이르에조르|하사카)주*)")## 시리아
        self.connection.rpush("@sys.state", "(베른|취리히|루체른|우리|슈비츠|옵발덴|니트발덴|글라루스|추크|졸로투른|바젤슈타트|바젤란트|샤프하우젠|아펜첼아우서로덴|아펜첼이너로덴|장크트갈렌|아르가우|투르가우|가르우뷘덴|프리부르|발레|보|뇌샤텔|제네바|쥐라|티치노)")## 스위덴
        self.connection.rpush("@sys.state", "((아시가바트|아할|발칸|다쇼구즈|레바프|마리)주*)")## 투르쿠메니스탄
        self.connection.rpush("@sys.state", "((가베스|가프사|나뵐|마누바|마디아|메드닌|모나스티르|베자|벤아루스|비제르테|수스|스팍스|시디부지드|실리아나|아리아나|자구완|젠두바|카세린|카이르완|케빌리|케프|타타우안|토죄르|튀니스)주*)")## 튀니지
        self.connection.rpush("@sys.state", "((아다|아디야만|아피온카라히사르|아르|아마시아|앙카라|안탈리아|아르트빈|아이딘|발리케시르|빌레지크|빙괼|비틀리스|볼루|부르두르|부르사|차나칼레|창키리|초룸|데니즐리|디야르바키르|에디르네|엘라지|에르진잔|에르주룸|에스키셰히르|가지안테프|기레순|귀뮈샤네|하카리|하타이|이스파르타|메르신|이스탄불|이즈미르|카르스|카스타모누|카이세리|키르칼라렐리|키르셰히르|코자엘리|콘야|퀴타히아|칼라티아|마니사|카라만마라슈|마르딘|물라|무슈|네브셰히르|니데|오르두|리제|사카리아|삼순|사이르트|시노프|시바스|테키르다|토카트|트라브존|툰젤리|샨리우르파우샤크|반|요즈가트|종굴다크|악사라이|바이부르트|카라만|키리칼레|바트만|시르나크|바르틴|아르다한|이디르|얄로바|카라뷔크|킬리스|오스마니예|뒤즈제)주*)")## 튀르키예
        self.connection.rpush("@sys.state", "(난터우현|롄장현|먀오리현|신주현|원린현|이란현|자이현|장화현|진먼현|타이둥현|펑후현|핑둥현|화롄현|신주시|자이시|지룽시)")## 타이완
        self.connection.rpush("@sys.state", "((아루샤|다르에스살람|도도마|게이타|이링가|카게라|카타비|키고마|킬리만자로|린디|마냐라|마라|므베야|모로고로|므트와라|므완자|느좀베|펨바 북부|펨바 남부|프와니|루콰|루부마|시미유|시니앙가|싱기다|타보라|탕가|잔지바르)주*)")## 탄자니아
        self.connection.rpush("@sys.state", "((체르카시|체르니히우|체르니우치|드니프로페트로우스크|도네츠크|이바노프란키우스크|하르키우|헤르손|흐멜니츠키|키로보흐라드|키이우|루한스크|리비우|미콜라이우|오데사|폴타바|리우네|수미|테르노필|빈니차|볼린|자카르파탸|자포리자|지토미르)주*)")## 우크라이나 
        self.connection.rpush("@sys.state", "((엘라베마|알래스카|애리조나|아칸소|캘리포니아|콜로라도|코네티컷|델라웨어|프롤리다|조지아|하와이|아이다호|일리노이|인디애나|아이오와|캔자스|켄터키|루이지애나|메인|메릴랜드|매샤추세츠|미시간|미네소타|미시시피|미주리|몬태나|네브래스카|네바다|뉴햄프셔|뉴저지|뉴멕시코|뉴욕|노스캐롤라이나|노스다코타|오하이오|오클라호마|오리건|펜실베이나아|로드아일랜드|사우스캐롤라이나|사우스다코타|테네시|텍사스|유타|버몬트|버니지아|워싱턴|웨스트버지니아|위스콘신|와이오밍)주*)")## 미국
        self.connection.rpush("@sys.state", "((아르티가스|카넬로네스|세로라르고|콜로니아|두라스노|플로레스|플로리다|라바예하|말도나도|몬테비데오|파이산두|리오네그로|리베라|로차|살토|산호세|소리아노|타콰렘보|트레인타이트레스)주*)")## 우루과이
        self.connection.rpush("@sys.state", "((안디잔|부하라|페르가나|지자흐|호레즘|나망간|나보이|카슈카다리야|카라칼파크스탄|사마르칸트|시르다리야|수르한다리야|타슈켄트)주*)")## 우즈베키스탄
        self.connection.rpush("@sys.location", "(서울특별시|서울시|서울|종로구|청운효자동|사직동|삼청동|부암동|평창동|무악동|교남동|가회동|종로|종로1가|종로2가|종로3가|종로4가|종로5가|종로6거|종로1가동|종로2가동|종로3가동|종로4가동|종로5가동|종로6가동|이화동|혜화동|창신제|창신제1동|창신제2동|창신제3동|숭인제|숭인제1동|숭인제2동|중구|소공동|회현동|명동|필동|장충동|광희동|을지로동|신당동|다산동|약수동|청구동|신장제5동|동화동|황학동|중림동|용산구|후암동|용산2가동|용산2가|남영동|청파동|원효로|원효로제1동|원효로제2동|효창동|용문동|한강로동|이촌동|이촌제1동|이촌1동|이촌제2동|이촌2동|이태원|이태원제1동|이태원제2동|한남동|서빙고동|보광동|성동구|왕십리도선동|왕십리제2동|마장동|사근동|행당동|행당제1동|행당제2동|응봉동|금호동|금호1가동|금호1가|금호2가동|금호2가|금호3가동|금호3가|금호4가동|금호4가|옥수동|성수1가제1동|성수1가|성수1가제2동|성수2가제1동|성수2가|성수2가제3동|송정동|용답동|광진구|중곡동|중곡|중곡제1동|중곡제2동|중곡제3동|중곡제4동|능동|구의동|구의|구의제1동|구의제2동|구의제3동|광장동|자양동|자양제|동|자양제2동|자양제3동|자양제4동|화양동|군자동|동대문구|용신동|제기동|전농동|전농제1동|전농제2동|답십리|답십리제1동|답십리제2동|장안동|장안제1동|장안제2동|청량리|청량리동|회기동|휘경동|휘경제1동|휘경제2동|이문동|이문제1동|이문제2동|중랑구|면목동|면목본동|면목제2동|면목제3동|면목제8동|면목제4동|면목제5동|면목제6동|상봉|상봉제1동|상봉제2동|상봉동|중화|중화동|중화제1동|중화제2동|묵동|묵제1동|묵제2동|망우본동|망우동|망우제3동|신내동|신내제1동|신내제2동|성북구|성북동|삼선동|동선동|돈암제1동|돈암제2동|돈암동|안암동|보문동|정릉|정릉제1동|정릉제2동|정릉제3동|정릉제4동|길음|길음동|길음제1동|길음제2동|종암동|월곡|월곡동|월곡제1동|월곡제2동|장위제|동|장위제2동|장위제3동|장위동|석관동|강북구|삼양동|미아동|송중동|송천동|삼각산동|번동|번1동|번2동|번3동|수유|수유동|수유1동|수유2동|수유3동|우이동|인수동|도봉구|쌍문|동|쌍문2동|쌍문3동|쌍문4동|쌍문동|방학동|방학1동|방학2동|방학3동|창동|창1동|창2동|창3동|창4동|창5동|도봉|도봉동|도봉1동|도봉2동|노원구|월계동|월계|월계1동|월계2동|월계3동|공릉|공릉동|공릉1동|공릉2동|하계|하계동|하계1동|하계2동|중계|중계동|중계본동|중계1동|중계2동|중계3동|중계4동|상계|상계동|상계1동|상계2동|상계3동|상계4동|상계5동|상계6동|상계7동|상계8동|상계9동|상계10동|은평구|녹번동|불광동|불광제1동|불광제2동|갈현동|갈현|갈현제1동|갈현제2동|구산동|대조동|응암|응암동|응암제1동|응암제2동|응암제3동|역촌동|신사제1동|신사|신사동|신사제2동|증산동|수색동|진관동|서대문구|충현동|천연동|북아현동|신촌동|연희동|홍제동|홍제제1동|홍제제2동|홍제제3동|홍은제1동|홍은동|홍은제2동|남가좌동|남가좌제1동|남가좌제2동|북가좌동|북가좌제1동|북가좌제2동|마포구|공덕동|아현동|도화동|용강동|대홍동|염리동|신수동|서강동|서교동|합정동|망원|동|망원2동|연남동|성산1동|성산2동|상암동|양천구|목1동|목2동|목3동|목4동|목5동|신월1동|신월2동|신월3동|신월4동|신월5동|신월6동|신월7동|신정1동|신정2동|신정3동|신4동|신정동|신정|신정6동|신정7동|강서구|염창동|등촌|등촌동|등촌제1동|등촌제2동|등촌제3동|화곡본동|화곡동|화곡|화곡제1동|화곡제2동|화곡제3동|화곡제4동|화곡제6동|화곡동|우장동|우장산동|가양|가양동|가양제1동|가양제2동|가양제3동|발산동|발산제1동|공항동|방화동|방화제1동|방화제2동|방화제3동|구로|구로구|신도림|신도림동|구로제1동|구로제2동|구로제3동|구로제4동|구로제5동|가리봉동|고척제1동|고척제2동|고척동|고척|개봉제1동|개봉동|개봉제2동|개봉제3동|오류동|오류제1동|오류제2동|수궁동|항동|금천구|가산동|독산제1동|독산제2동|독산제3동|독산제4동|독산동|시흥제1동|시흥제2동|시흥제3동|시흥제4동|시흥제5동|시흥동|시흥|독산|영등포구|영등포|영등포본동|영등포|여의|당산제1동|당산제2동|도림동|문래동|양평제1동|양평제2동|신길제1동|신길제3동|신길제4동|신길제5동|신길제6동|신길제7동|대림제1동|대림제2동|대림제3동|동작구|노량진제1동|노량진제2동|상도제1동|상도제2동|상도제3동|상도제4동|노량진상도|상도동|흑석동|흑석|사당제1동|사당제2동|사당제3동|사당제4동|사당제5동|대방동|신대방제1동|신대방제2동|사당|사당동|신대방|관악구|관악|보라매동|은천동|성현동|중앙동|청림동|행운동|청룡동|낙성대동|낙성대|인헌동|남현동|신림동|신사동|신림|신사|조원동|미성동|난곡동|난향동|서원동|신동원|서림동|삼성동|대학동|서초구|서초|서초1동|서초2동|서초3동|서초4동|잠원|잠원동|반포본동|반포|반포1동|반포2동|반포3동|반포4동|방배본동|방배|방배동|방배1동|방배2동|방배3동|방배4동|양재1동|양재2동|내곡동|양재|양재동|강남구|강남|신사동|신사|논현1동|논현|논현동|논현2동|압구정동|압구정|청담동|청담|삼성동|삼성|삼성1동|삼성2동|대치1동|대치2동|대치4동|대치|대치동|역삼1동|역삼2동|역삼동|도곡1동|도곡2동|도곡동|개포1동|개포2동|개포4동|일원본동|일원동|일원1동|일원2동|수서동|세곡동|수서|세곡|송파구|송파|풍납1동|풍납2동|거여1동|거여2동|마천1동|마천2동|마천동|방이동|방이1동|방이2동|오륜동|오금동|송파1동|송파2동|석촌동|삼전동|가락본동|가락1동|가락2동|문정1동|문정2동|장지동|위례동|잠실본동|잠실2동|잠실3동|잠실4동|잠실6동|잠실7동|강동구|강일동|상일동|명일제1동|명일제2동|고덕제1동|고덕제2동|암사제1동|암사제2동|암사제3동|천호제1동|천호제2동|천호제3동|성내제1동|성내제2동|성내제3동|길동|둔촌제동1|둔촌제2동|개포동|송파|석촌|가락동|문정|문정동|장지|잠실|잠실동|명일동|암사동|천호동|성내동|둔춘동)") ## 서울특별시
        self.connection.rpush("@sys.location", "(부산광역시|부산시|부산|중구|중앙|동광동|대청동|보수동|부평동|광복동|남포동|영주동|영주제1동|영주제2동|부평|대청서구|서대신제동|서대신제1동|서대신제2동|서대신제3동|서대신제4동|부민동|아미동|초장동|충무동|남부민제1동|남부민제2동|남부민동|안남동|동구|초량동|초량제1동|초량제2동|초량제3동|초량제6동|수정동|수정제1동|수정제2동|수정제4동|수정제5동|좌천동|범일동|범일제1동|범일제2동|범일제5동|영도구|남항동|영선동|영선제1동|영선제2동|신선동|봉래동|봉래제1동|봉래제2동|청학동|청학제1동|청학제|동|동삼제1동|동삼제2동|동삼제3동|동삼동|부산진구|부전제1동|부전동|부전제2동|연지동|초읍동|양정제1동|양정동|양정제2동전포동||전포제1동|전포제2동|부암동|부암제1동|부암제3동|당감제1동|당감제2동|당감제4동|가야제1동|가야제2동|개금제1동|개금제2동|개금제3동|범천제1동|범천제2동|동래구|수민동|복산동|명륜동|온천제1동|온천제2동|온천제3동|온천동|사직동|사직제1동|사직제2동|사직제3동|안락동|안락제1동|안락제2동|명장동|명장제1동|명장제2동|남구|대연동|대연제1동|대연제3동|대연제4동|대연제5동|대연제6동|용호동|용호제1동|용호제2동|용호제3동|용호제4동|용당동|감만동|감만제1동|감만제2동|우암동|문현동|문현제1동|문현제2동|문현제3동|문현제4동|북구|구포동|구포1동|구포제2동|구포제3동|금곡동|화명동|화명제1동|화명제2동|화명제3동|덕천동|덕천제1동|덕천제2동|덕천제3동|만덕동|만덕제1동|만덕제2동|만덕제3동|해운대구|해운대|우제|동|우제2동|우제3동|우제동|중제1동|중제2동|중제동|좌제1동|좌제2동|좌제3동|좌동|좌제4동|송정동|반여제1동|반여동|반여제2동|반여제3동|반여제4동|반송제1동|반송제2동|재송제1동|재송제2동|반송동|재송동|사하구|괴정제1동|괴정제2동|괴정제3동|괴정제4동|괴종동|당리동|하단제1동|하단제2동|하단동|신평제1동|신평제2동|신평동|장림제1동|장림제2동|장림동|다대제1동|다대제2동|다대동|구평동|감천제1동|감천제2동|감천동|금정구|서제1동|서제2동|서제3동|서동|금사회동|부곡제1동|부곡제2동|부곡제3동|부곡제4동|부곡동|장전제1동|장전제2동|장전동|선두구동|청룡노포동|남산동|구서제1동|구서제2동|구서동|금성동|강서구|대저1동|대저2동|대동|강동|명지1동|명지2동|명동|가락동|녹산동|가덕도동|연제구|거제제1동|거제제2동|거제제3동|거제제4동|거제동|연산제1동|연산제2동|연산제3동|연산제4동|연산제5동|연산제6동|연산제8동|연산제9동|연산동|수영구|남천제1동|남천제2동|남천동|수영동|망미제1동|망미제2동|망미동|광안제1동|광안제2동|광안제3동|광안제4동|광안동|민략동|사상구|삼락동|모라제1동|모라제3동|모라동|덕포제|동|덕포제2동|덕포동|괘법동|감전동|주례제1동|주례제2동|주례제3동|주례동|학장동|엄궁동|기장군|기장읍|장안읍|정관읍|일광면|철마면)") ## 부산광역시
        self.connection.rpush("@sys.location", "(대구광역시|대구시|대구|중구|동인동|삼덕동|성내1동|성내2동|성내3동|성내동|대신동|남산1동|남산2동|남산3동|남산4동|대봉1동|대봉2동|남산동|대봉동|동구|신암1동|신암2동|신암3동|신암4동|신암5동|신암동|신천1동|신천2동|신천3동|신천4동|신천동|효목1동|효목2동|효목동|도평동|불로봉무동|지저동|동촌동|방촌동|해안동|안심1동|안심2동|안심3동|안심4동|혁신동|공산동|안심동|서구|내당1동|내당2동|내당3동|내당4동|내당동|비산1동|비산2동|비산3동|비산4동|비산5동|비산6동|비산7동|비산동|평리1동|평리2동|평리3동|평리4동|평리5동|평리6동|상중이동|원대동|평리동|남구|이천동|봉덕1동|봉덕2동|봉덕3동|봉덕동|대명1동|대명2동|대명3동|대명4동|대명5동|대명6동|대명9동|대명10동|대명동|대명동|북구|고성동|칠성동|침산1동|침산2동|침산3동|침산동|노원동|산격1동|산격2동|산격3동|산격4동|산격동|복현1동|복현2동|북현동|대현동|검단동|무태조야동|관문동|태전1동|태전2동|태전동|구암동|관음동|읍내동|동천동|국우동|수성구|범어1동|범어2동|범어3동|범어4동|범어동|만촌1동|만촌2동|만촌3동|만촌동|수성1가동|수성2가동|수성3가동|수성4가동|수성동|황금1동|황금2동|황긍동|중동|상동|파동|두산동|지산1동|지산2동|범물1동|범물2동|범물동|고산1동|고산2동|고산3동|고산동|달서구|성당동|두류1동|두류2동|두류3동|두류동|본리동|감삼동|죽전동|장기동|용산1동|용산2동|용산동|이곡동|이곡2동|신당동|월성1동|월성2동|진천동|월성동|상인1동|상인2동|상인3동|상인동|도원동|송현1동|송현2동|송현동|본동|달성군|화원읍|논공읍|다사읍|유가읍|옥포읍|현풍읍|가창면|하빈면|구지면)") ## 대구광역시
        self.connection.rpush("@sys.location", "(인천광역시|인천시|인천|중구|신폰동|연안동|신흥동|도원동|율목동|동인천동|북성동|송월동|영종동|영종1동|운선동|용유동|동구|만석동|화수1동|화평동|화수2동|송현1동|화수동|송현2동|송현3동|송현동|송림1동|송림2동|송림3동|송림5동|송림4동|송림6동|금창동|송림동|미추홀구|숭의1동|숭의3동|숭의2동|숭의4동|숭의동|용현1동|용현4동|용현2동|용현5동|용현3동|용현동|학익1동|학익2동|도화1동|학익덩|도화동|도화2동|도화3동|주안1동|주안2동|주안3동|주안4동|주안5동|주안6동|주안7동|주안8동|관교동|문학동|주안동|연수구|옥련1동|옥련2동|선학동|연수1동|연수2동|연수3동|청학동|동춘1동|동춘2동|동춘3동|송도1동|송도2동|송도3동|송도4동|송도5동|송도동|연수동|옥련동|남동구|구월1동|구월2동|구월3동|구월4동|구월동|간석1동|간석2동|간석3동|간석4동|간석동|만수1동|만수2동|만수3동|만수4동|만수5동|만수6동|만수동|장수서창동|서창2동|남촌도림동|논현1동|논현2동|논현고잔동|논현동|부평구|부평1동|부평2동|부평3동|부평4동|부평5동|부평6동|부평동|산곡1동|산곡2동|산곡3동|산곡4동|산곡동|청천1동|청천2동|청천동|갈산1동|갈산2동|갈산동|삼산1동|삼산2동|삼산동|부개1동|부개2동|부개3동|부개동|일신동|십정1동|십정2동|십정동|계양구효성1동|효성2동|효성동|계산1동|계산2동|계산3동|계산4동|계산동|작전1동|작전2동|작전동|서운동|계양1동|계양2동|계양3동|계양동|서구|검앙경서동|연희동|청라1동|청라2동|청라3동|청라동|가정1동|가정2동|가정3동|가정동|신현원창동|석남1동|석남2동|석남3동|석남동|가좌1동|가좌2동|가좌3동|가좌4동|검단동|가좌동|불로대곡동|원당동|당하동|오류왕길동|마전동|강화군|강화읍|선원면|불은면|길상면|화도면|양도면|내가면|하점면|양사면|송해면|교동면|삼산면|서도면|옹진군|북도면|연평면|백령면|대청면|덕적면|자월면|영흥면)") ## 인천광역시
        self.connection.rpush("@sys.location", "(광주광역시|광주시|광주|동구|총장동|동명동|계림1동|계림2동|산수1동|산수2동|지원1동|지원2동|서남동|학동|학운동|지산1동|지산2동|계림동|산수동|지원동|지산동|서구|양동|양3동|농성1동|농성2동|광천동|유덕동|치평동|상무1동|상무2동|화정1동|화정2동|화정3동|화정4동|서창동|금호1동|금호2동|풍암동|동천동|화정동|상무동|남구|양림동|방림1동|방림2동|방림동|봉선1동|봉선동|사직동|월산동|월산4동|월산5동|백운1동|백운2동|주월1동|주월2동|주월동|효덕동|송암동|대촌동|북구|중흥1동|중흥2동|중흥3동|중흥동|중앙동|임동|신안동|용봉동|운암1동|운암2동|운암3동|동림동|운암동|우산동|풍향동|문화동|문흥1동|문흥2동|두암1동|두암2동|두암3동|두암동|문흥동|삼각동|일곡동|매곡동|오치1동|오치2동|석곡동|건국동|양산동|신용동|광산구|송정1동|송정2동|도산동|송정동|신흥동|어룡동|우산동|월곡1동|월곡2동|월곡동|비아동|첨단1동|첨단2동|첨단동|신가동|운남동|신창동|수완동|하남동|임곡동|동곡동|평동|삼도동|본량동)") ## 광주광역시
        self.connection.rpush("@sys.location", "(대전광역시|대전시|대전|동구|중앙동|신인동|효동|판암1동|판암2동|판암동|용운동|대동|자양동|가양1동|가양2동|가양동|용전동|성남동|홍도동|삼성동|대청동|산내동|중구|은행선화동|목동|중촌동|대흥동|문창동|석교동|대사동|부사동|용두동|오류동|태평1동|태평2동|유천1동|유천2동|문화1동|문화2동|산성동|문화동|유천동|서구|복수동|도마1동|도마2동|정림동|변동|용문동|탄방동|괴정동|가장동|내동|갈마1동|갈마2동|갈마동|월평1동|월평2동|월평동|월평3동|만년동|둔산1동|둔산2동|둔산3동|둔산동|가수원동|관저1동|관저2동|기성동|관저동|유성구|진잠동|원신흥동|온천1동|온천2동|온천동|노은1동|노은2동|노은동|노은3동|신성동|전민동|구즉동|관평동|대덕구|오정동|대화동|회덕동|비래동|송촌동|중리동|법1동|법2동|신타진동|석봉동|덕암동|목상동|법동)") ## 대전광역시
        self.connection.rpush("@sys.location", "(울산광역시|울산시|울산|중구|학성동|반구1동|반구2동|반구동|복산1동|복산2동|복산동|성안동|중앙동|우정동|태화동|다운동|병영1동|병영2동|약사동|병영동|남구|신정1동|신정2동|신정3동|신정4동|신정5동|신정동|달동|삼산동|삼호동|무거동|옥동|야음장생포동|대현동|수암동|선암동|동구|방어동|일산동|화정동|대송동|전하1동|전하2동|남목1동|남목2동|남목3동|북구동|전하동|남목동|농소1동|농소2동|농소3동|농소동|강동|효문동|송정동|양정동|염포동|울주군|범서읍|온산읍|언양읍|온양읍|청량읍|삼남읍|서생면|웅촌면|두동면|두서면|상북면|삼동면)") ## 울산광역시
        self.connection.rpush("@sys.location", "(세종특별자치시|세종시|세종|조치원읍|연기면|연동면|부강면|금남면|장군면|연서면|전의면|전동면|소정면|한솔동|도담동|아름동|종촌동|고운동|보람동|새롬동|대평동|소담동|다정동)") ## 세종특별자치시
        self.connection.rpush("@sys.location", "(경기도|경기|수원시|장안구|파장동|율천동|정자1동|정자2동|정자3동|정자동|영화동|송죽동|조원1동|조원2동|연무동|조원동|권선구|세류1동|세류2동|세류3동|평동|서둔동|구운동|금곡동|호매실동|권선1동|권선2동|곡선동|입북동|팔달구동|행궁동|매교동|매산동|고등동|화서1동|화서2동|지동|우만1동|우만2동|인계동|화서동|영통구|매탄1동|매탄2동|매탄3동|매탄4동|원천동|광교1동|광교2동|영통1동|영통2동|영통3동|망포1동|망포2동|망포동|광교동|고양시|덕양구|주교동|원신동|흥도동|성사1동|성사2동|효자동|삼송동|창릉동|고양동|관산동|능곡동|화정1동|화정2동|행주동|행신1동|행신2동|행신3동|화전동|대덕동|행신동|화정동|일산동구|식사동|중산동|정발산동|풍산동|백석1동|백석2동|백석동|마두1동|마두2동|장항1동|장항2동|장항동|고봉동|일산서구|일산1동|일산2동|일산3동|탄현동|주엽1동|주엽2동|대화동|송포동|송산동|일산동|주엽동|용인시|처인구|포곡읍|모현읍|이동읍|남사면|원삼면|백암면|양지면|중앙동|역삼동|유림동|동부동|기흥구|신갈동|영덕1동|영덕2동|영덕동|구갈동|상갈동|보라동|기흥동|서농동|구성동|마북동|동백1동|동백2동|동백3동|상하동|보정동|동백동|수지구|풍덕천1동|풍덕천2동|신봉동|풍덕천동|죽전1동|죽전2동|동천동|죽전동|죽전|상현1동|상현2동|성복동|상현동|성남시|수정구|신흥1동|신흥2동|신흥3동|태평1동|태평2동|태평3동|태평4동|수진1동|수진2동|태평동|수진동|단대동|산성동|양지동|복정동|위례동|신촌동|고등동|시흥동|중원구|성남동|중앙동|금광1동|금광2동|은행1동|은행2동|상대원1동|상대원2동|상대원3동|하대원동|도촌동|금광동|은행동|상대원동|분당구|분당동|수내1동|수내2동|수내3동|정자동|정자1동|정자2동|정자3동|정자동|수내동|서현1동|서현2동|서현동|이매1동|이매2동|이매동|야탑1동|야탑2동|야탑동|야탑3동|판교동|삼평동|백현동|금곡동|구미동|구미1동|운중동|판교부천시|심곡동|부천동|중동|신중동|상동|대산동|소사본동|범안동|성곡동|오정동|화성시|봉담읍|우정읍|향남읍|남양읍|매송면|비봉면|마도면|송산면|서신면|팔탄면|장안면|양감면|정남면|새솔동|진안동|병점1동|병점2동|반월동|기배동|화산동|동탄1동|동탄2동|동탄3동|동탄4동|동탄5동|동탄6동|동탄7동탄8동|안산시|상록구|일동|이동|사동|사이동|해양동|본오1동|본오2동|본오3동|본오동|부곡동|월피동|성포동|반월동|안산동|단원구|와동|고잔동|중앙동|호수동|원곡동|백운동|신길동|초지동|선부1동|선부2동|선부3동|대부동|선부동|남양주시|와부읍|진접읍|화도읍|진건읍|오남읍|퇴계원읍|별내면|수동면|조안면|호평동|평내동|금곡동|양정동|다산1동|다산2동|별내동|얀양시|만안구|안양1동|안양2동|안양3동|안양4동|안양5동|안양6동|안양7동|안양8동|안양9동|석수1동|석수2동|석수3동|박달1동|박달2동|안양동|석수동|동안구|비산1동|비산2동|비산3동|부흥동|달안동|관양1동|관양2동|부림동|평촌동|평안동|귀인동|호계1동|호계2동|호계3동|범계동|신촌동|갈산동|호계동|관양동|비산동|평택시|팽성읍|안중읍|포승읍|청북읍|진위면|서탄면|고덕면|오성면|현덕면|중앙동|서정동|송탄동|지산동|송북동|신장1동|신장2동|신평동|원평동|통복동|비전1동|비전2동|세교동|용이동|시흥시|시흥|대야동|신천동|신현동|은행동|매화동|목감동|군자동|월곶동|정왕본동|정왕1동|정왕2동|정왕3동|정왕4동|배곧동|과림동|연성동|장곡동|능곡동|정왕동|파주시|문산읍|파주읍|법원읍|조리읍|월룡면|탄현면|광탄면|파평면|적성면|군내면|장단면|진동면|진서면|교하동|운정1동|운정2동|운정3동|금촌1동|금촌2동|금촌3동|의정부시|의정부1동|의정부2동|호원1동|호원2동|장암동|신곡1동|의정부|호원동|신곡동|신곡2동|송산1동|송산2동|송산3동|자금동|가능동|흥선동|녹양동|송산동|김포시|통진읍|고촌읍|양촌읍|대곶면|월곶면|하성면|풍무동|김포본동|구래동|장기동|운양동|장기본동|사우동|마사동|광주시|오포읍|초월읍|곤지암읍|도척면|퇴촌면|남종면|남한산성면|경안동|쌍령동|송정동|탄벌동|광남1동|광남2동|광명시|광명1동|광명2동|광명3동|광명4동|광명5동|광명6동|광명7동|철산1동|철산2동|철산3동|철산4동|하안1동|하안2동|하안3동|하안4동|소하1동|소하2동|학온동|광남동|광명동|광명|철산동|군포시|군포1동|군포2동|산본1동|산본2동|금정동|재궁|동오금동|수리동|궁내동|대야동|광정동|군포동|하안동|소하동|하남시|천현동|신장1동|신장2동|덕풍1동|덕풍2동|덕풍3동|풍산동|감북동|감일동|위례동|춘궁동|초이동|미사1동|미사2동|미사동|덕풍동|신장동|오산시|중앙동|남촌동|신장동|세마동|초평동|대원동|양주시|백석읍|은현면|남면|광적면|장흥면|양주1동|양주2동|회천1동|회천2동|회천3동|회천4동|이천시|장호원읍|부발읍|신둔면|백사면|호법면|마장면|대월면|모가면|설성면|율면|창전동|증포동|중리동|관고동|구리시|갈매동|동구동|인창동|교문1동|교문2동|수택1동|수택2동|수택3동|교문동|수택동|안성시|공도읍|보개면|금광면|서운면|미양면|대덕면|양성면|원곡면|일죽면|죽산면|삼죽면|고삼면|안성1동|안성2동|안성3동|포천시|소흘읍|군내면|내촌면|가산면|신북면|창수면|영중면|일동면|이동면|영북면|관인면|화현면|포천동|선단동|의왕시|고천동|부곡동|오전동|내손1동|내손2동|청계동|양평군|내손동|양평읍|가상면|강하면|양서면|옥천면|서종면|단월면|청운면|양동면|지평면|용문면|개군면|여주시|가남읍|점동면|흥천면|금사면|능서면|대신면|북내면|강천면|산북면|여흥동|중앙동|오학동|동두천시|생연1동|생연2동|중앙동|보산동|불현동|송내동|소요동|상패동|생연동|가평군|가평읍|설악면|청평면|상면|조종면|북면|과천시|중앙동|갈현동|별양동|부림동|과천동|문원동|연천군|연천읍|전곡읍|군남면|청산면|백학면|미산면|왕징면|신서면|중면|장남면)") ## 경기도
        self.connection.rpush("@sys.location", "(강원도|춘천시|신북읍|동면|동산면|신동면|동내면|남면|남산면|서면|사북면|북산면|소양동|교동|조운동|약사명동|근화동|후평1동|후평2동|후평3동|효자1동|효자2동|효자3동|석사동|퇴계동|강남동|신사우동|원주시|문막읍|소초면|호저면|지정면|부론면|귀래면|흥업면|판부면|신림면|중앙동|원인동|개운동|명륜1동|명륜2동|단구동|일산동|학성동|단계동|우산동|태장1동|태장2동|봉산동|행구동|무실동|반곡관설동|강릉시|주문진읍|성산면|왕산면|구정면|강동면|옥계면|사천면|연곡면|홍제동|중앙동|옥천동|교1동|교2동|포남1동|포남2동|초당동|송정동|내곡동|강남동|성덕동|경포동|동해시|천곡동|송정동|북삼동|부곡동|동호동|발한동|묵호동|북평동|망상동|삼화동|태백시|황지동|황연동|삼수동|상장동|문곡소도동|장성동|구문소동|철암동|속초시|영랑동|동명동|금호동|교동|노학동|조양동|청호동|대포동|삼척시|도계읍|원덕읍|근덕면|하장면|노곡면|미로면|가곡면|신기면|남양동|성내동|교동|정라동|홍천군|홍천읍|화천면|두촌면|내촌면|서석면|동면|남면|서면|북방면|내면|횡성군|횡성읍|우천면|안흥면|둔내면|갑천면|청일면|공근면|서원면|강림면|영월군|영월읍|상동읍|중동면|김삿갓면|북면|남면|한반도면|주천면|무릉도원면|평창군|평창읍|미탄면|방림면|대화면|봉평면|용평면|진부면|대관령면|정선군|정선읍|고한읍|사북읍|신동읍|화암면|남면|여량면|북평면|임계면|철원군|철원읍|김화읍|갈말읍|동송읍|서면|근남면|근북면|근동면|원동면|원남면|임남면|화천군|화천읍|간동면|하남면|상서면|사내면|양구군|양구읍|국토정중앙면|동면|방산면|해안면|인제군|인제읍|남면|북면|기린면|서화면|상남면|고성군|간성읍|거진읍|현내면|죽왕면|토성면|수동면|양양군|양양읍|서면|손양면|현북면|현남면|강현면)") ## 강원도
        self.connection.rpush("@sys.location", "(충청북도|충북|청주시|상당구|낭성면|미원면|가덕면|남일면|문의면|중앙동|성안동|탑대성동|영운동|금천동|용담동|명암동|산성동|용암1동|용암2동|서원구|남이면|현도면|사직1동|사직2동|사창동|모충동|산남동|분평동|수곡1동|수곡2동|성화동|개신동|죽림동|흥덕구|오송읍|강내면|옥산면|운천동|신봉동|복대1동|복대2동|가경동|봉명1동|봉명2동|송정동|강서제1동|강서제2동|청원구|내수읍|오창읍|북이면|우암동|내덕1동|내덕2동|율량동|사천동|오근장동|충주시|주덕읍|살미면|수안보면|대소원면|신니면|노은면|양성면|중앙탑면|금가면|동량면|산척면|엄정면|소태면|성내동|충인동|교현동|안림동|교현2동|용산동|지현동|문화동|호암동|직동|달천동|봉방동|칠금동|금릉동|연수동|목행동|용탄동|제천시|봉양읍|금성면|청풍면|수산면|덕산면|한수면|백운면|송학면|교동|의림지동|중앙동|남현동|영서동|용두동|신백동|청전동|화산동|보은군|보은읍|속리산면|장안면|마로면|탄부면|삼승면|수한면|회남면|회인면|내북면|산외면|옥천군|옥천읍|동이면|안남면|안내면|청성면|청산면|이원면|군서면|군북면|영동군|영동읍|용산면|황간면|추풍령면|매곡면|상촌면|양강면|용화면|학산면|양산면|심천면|증평군|증평읍|도안면|진천군|진천읍|덕산읍|초평면|문백면|백곡면|이월면|광혜원면|괴산군|괴산읍|감물면|장연면|연풍면|칠성면|문광면|청천면|청안면|사리면|소수면|불정면|음성군|음성읍|금왕읍|소이면|원남면|맹동면|대소면|삼성면|생극면|감곡면|단양군|단양읍|매포읍|대강면|가곡면|영춘면|어상천면|적성면|단성면)") ## 충청북도
        self.connection.rpush("@sys.location", "(충청남도|충남|천안시|동남구|목천읍|풍세면|광덕면|북면|성남면|수신면|병천면|동면|중앙동|문성동|원성1동|원성2동|봉명동|일봉동|신방동|청룡동|신안동|서북구|성환읍|성거읍|직산읍|입장면|성정1동|성정2동|쌍용1동|쌍용2동|쌍용3동|백석동|불당동|부성1동|부성2동|공주시|유구읍|이인면|탄천면|계룡면|반포면|의당면|정안면|우성면|사곡면|신풍면|중학동|웅진동|금학동|옥룡동|신관동|월송동|보령시|웅천읍|주포면|오천면|천북면|청소면|청라면|남포면|주산면|미산면|성주면|주교면|대천1동|대천2동|대천3동|대천4동|대천5동|아산시|염치읍|배방읍|송악면|탕정면|음봉면|둔포면|영인면|인주면|선장면|도고면|신창면|온양1동|온양2동|온양3동|온양4동|온양5동|온양6동|서산시|대산읍|인지면|부석면|팔봉면|지곡면|성연면|음암면|운산면|해미면|고북면|부춘동|동문1동|동문2동|수석동|석남동|논산시|강경읍|연무읍|성동면|광석면|노성면|상월면|부적면|연산면|벌곡면|양촌면|가양곡면|은진면|채운면|취암동|부창동|계룡시|두마면|엄사면|신도안면|금암동|당진시|합덕읍|송악읍|고대면|석문면|대호지면|정미면|면천면|순성면|우강면|신평면|송산면|당진1동|당진2동|당진3동|금산군|금산읍|금성면|제원면|부리면|군북면|남일면|남이면|진산면|복수면|추부면|부여군|부여읍|규암면|은산면|외산면|내산면|구룡면|홍산면|옥산면|남면|충화면|양화면|임천면|장암면|세도면|석성면|초촌면|서천군|장항읍|서천읍|마서면|화양면|기산면|한산면|마산면|시초면|문산면|판교면|종천면|비인면|서면|청양군|청양읍|운곡면|대치면|정산면|목면|청남면|장평면|남양면|화성면|비봉면|홍성군|홍성읍|광천읍|홍북읍|금마면|홍동면|장곡면|은하면|결성면|서부면|갈산면|구항면|예산군|예산읍|삽교읍|대술면|신양면|광시면|대흥면|응봉면|덕산면|봉산면|고덕면|신암면|오가면|태안군|태안읍|안면읍|고남면|남면|근흥면|소원면|원북면|이원면)") ## 충청남도
        self.connection.rpush("@sys.location", "(전라북도|전북|전주시|완산구|중앙동|풍남동|노송동|완산동|동서학동|서서학동|중화산1동|중화산2동|평화1동|평화2동|중화산동|평화동|서신동|삼천1동|삼천2동|삼천3동|효자1동|효자2동|효자3동|효자4동|효자5동|효자동|삼천동|덕진구|진북동|인후1동|인후2동|인후3동|덕진동|금암1동|금암2동|팔복동|우아1동|우아2동|호성동|송천1동|송천2동|조촌동|여의동|혁신동|인후동|송천동|금암동|군산시|옥구읍|옥산면|회현면|임피면|서수면|대야면|개정면|성산면|나포면|옥도면|옥서면|해신동|월명동|신풍동|삼학동|중앙동|흥남동|조촌동|경암동|구암동|개정동|수송동|나운1동|나운2동|나운3동|소룡동|미성동|익산시|함열읍|오산면|황등면|함라면|응포면|성당면|용안면|낭산면|망성면|여산면|금마면|왕궁면|춘포면|삼기면|용동면|중앙동|평화동|인화동|동산동|마동|남중동|모현동|송학동|신동|영등1동|영등2동|어양동|팔봉동|삼성동|정읍시|신태인읍|북면|입암면|소성면|고부면|영원면|덕천면|이평면|정우면|태인면|감곡면|옹동면|칠보면|산내면|산외면|수성동|장명동|내장상동|시기동|초산동|연지동|농소동|상교동|남원시|운봉읍|주천면|수지면|송동면|주생면|금지면|대강면|대산면|사매면|덕과면|보절면|산동면|이백면|인월면|아영면|산내면|동충동|죽항동|노암동|금동|왕정동|향교동|도통동|김제시|만경읍|죽산면|백산면|용지면|백구면|부량면|공덕면|청하면|성덕면|진봉면|금구면|봉남면|황산면|금산면|광활면|요촌동|신풍동|검산동|교월동|완주군|삼례읍|봉동읍|용진읍|상관면|이서면|소양면|구이면|고산면|비봉면|운주면|화산면|동상면|경천면|진안군|진안읍|용담면|안천면|동향면|상전면|백운면|성수면|마령면|부귀면|정천면|주천면|무주군|무주읍|무풍면|설천면|적상면|안성면|부남면|장수군|장수읍|산서면|번암면|장계면|천천면|계남면|계북면|임실군|임실읍|청웅면|운암면|신평면|성수면|오수면|신덕면|삼계면|관촌면|강진면|덕치면|지사면|순창군|순창읍|인계면|동계면|적성면|유등면|풍산면|금과면|팔덕면|복흥면|쌍치면|구림면|고창군|고창읍|고수면|아산면|무장면|공음면|상하면|해리면|성송면|대산면|심원면|흥덕면|성내면|신림면|부안면|부안군|부안읍|주산면|동진면|행안면|계화면|보안면|변산면|진서면|백산면|상서면|하서면|줄포면|위도면)") ## 전라북도
        self.connection.rpush("@sys.location", "(전라남도|전남|목포시|용당2동|연동|산정동|연산동|원산동|대성동|목원동|동명동|삼학동|만호동|유달동|죽교동|북항동|용해동|이로동|상동|하당동|신흥동|삼향동|옥암동|부흥동|부주동|여수시|돌산읍|소라면|율촌면|화양면|남면|화정면|삼산면|동문동|한려동|중앙동|충무동|광림동|서강동|대교동|국동|월호동|여서동|문수동|미평동|둔덕동|만덕동|쌍봉동|시전동|여천동|주삼동|삼일동|묘도동|순천시|승주읍|주암면|송광면|외서면|낙안면|별량면|상사면|해룡면|서면|황전면|월등면|향동|매곡동|삼산동|조곡동|덕연동|풍덕동|남제동|저전동|장천동|중앙동|도사동|왕조1동|왕조2동|나주시|남평읍|세지면|왕곡면|반남면|공산면|동강면|다시면|문평면|노안면|금천면|산포면|다도면|봉황면|송월동|영강동|금남동|성북동|영산동|이창동|빛가람동|광양시|광양읍|봉강면|옥룡면|옥곡면|진상면|진월면|다압면|골약동|중마동|광영동|태인동|금호동|담양군|담양읍|봉산면|고서면|가사문학면|창평면|대덕면|무정면|금성면|용면|월산면|수북면|대전면|곡성군|곡성읍|오곡면|삼기면|석곡면|목사동면|죽곡면|고달면|옥과면|입면|겸면|오산면|구례군|구례읍|문척면|간전면|토지면|마산면|광의면|용방면|산동면|고흥군|고흥읍|도양읍|풍양면|도덕면|금산면|도화면|포두면|봉래면|동일면|점암면|영남면|과역면|남양면|동강면|대서면|두원면|보성군|보성읍|벌교읍|노동면|미력면|겸백면|율어면|복내면|문덕면|조성면|득량면|회천면|웅치면|화순군|화순읍|한천면|춘양면|청풍면|이양면|능주면|도곡면|도암면|이서면|백아면|동복면|사평면|동면|장흥군|장흥읍|관산읍|대덕읍|용산면|안양면|장동면|장평면|유치면|부산면|회진면|강진군|강진읍|군동면|칠량면|대구면|마량면|도암면|신전면|성전면|작천면|병영면|옴천면|해남군|해남읍|삼산면|화산면|현산면|송지면|북평면|북일면|옥천면|계곡면|마산면|황산면|산이면|문내면|화원면|영암군|영암읍|삼호읍|덕진면|금정면|신북면|시종면|도포면|군서면|서호면|학산면|미암면|무안군|무안읍|일로읍|삼향읍|몽탄면|청계면|현경면|망운면|해제면|운남면|함평군|함평읍|손불면|신광면|학교면|엄다면|대동면|나산면|해보면|월야면|영광군|영광읍|백수읍|홍농읍|대마면|묘량면|불갑면|군서면|군남면|염산면|법성면|낙월면|장성군|장성읍|진원면|남면|동화면|삼서면|삼게면|황룡면|서삼면|북일면|북이면|북하면|완도군|완도읍|금일읍|노화읍|군외면|신지면|고금면|약산면|청산면|소안면|금당면|보길면|생일면|진도군|진도읍|군내면|고군면|의신면|임회면|지산면|조도면|신안군|지도읍|압해읍|증도면|임자면|자은면|비금면|도초면|흑산면|하의면|신의면|장산면|안좌면|팔금면|암태면)") ## 전라남도
        self.connection.rpush("@sys.location", "(경상북도|경북|포항시|남구|구룡포읍|연일읍|오천읍|대송면|동해면|장기면|호미곶면|상대동|해도동|송도동|청림동|제철동|효곡동|대이동|북구|흥해읍|신광면|청하면|송라면|기계면|죽장면|기북면|중앙동|양학동|죽도동|용흥동|우창동|두호동|장량동|환여동|경주시|감포읍|안강읍|건천읍|외동읍|양북면|양남면|내남면|산내면|서면|현곡면|강동면|천북면|중부동|황오동|성건동|황남동|월성동|선도동|용강동|황성동|동천동|불국동|보덕동|김천시|아포읍|농소면|남면|개령면|감문면|어모면|봉산면|대항면|감천면|조마면|구성면|지례면|부항면|대덕면|증산면|자산동|평화남산동|양금동|대신동|대곡동|지좌동|율곡동|안동시|풍산읍|와룡면|북후면|서후면|풍천면|일직면|남후면|남선면|임하면|길안면|임동면|예안면|도산면|녹전면|중구동|명륜동|용상동|서구동|태화동|평화동|안기동|옥동|송하동|강남동|구미시|선사읍|고아읍|무을면|옥성면|도개면|해평면|산동면|장천면|송정동|원평1동|원평2동|지산동|도량동|선주원남동|형곡1동|형곡2동|신평1동|신평2동|비산동|공단1동|공단2동|광평동|상모사곡동|임오동|인동동|진미동|양포동|영주시|풍기읍|이산면|평은면|문수면|장수면|안정면|봉현면|순흥면|단산면|부석면|상망동|하망동|영주1동|영주2동|휴천1동|휴천2동|휴천3동|가흥1동|가흥2동|영천시|금호읍|청통면|신녕면|화산면|화북면|화남면|자양면|임고면|고경면|북안면|대창면|동부동|중앙동|서부동|완산동|남부동|상주시|함창읍|사벌국면|중동면|낙동면|청리면|공성면|외남면|내서면|모동면|모서면|화동면|화서면|화북면|외서면|은척면|공검면|이안면|화남면|남원동|북문동|계림동|동문동|동성동|신흥동|문경시|문경읍|가은읍|영순면|산양면|호게면|산북면|동로면|마성면|농암면|점촌1동|점촌2동|점촌3동|점촌4동|점촌5동|경산시|하양읍|진량읍|압량읍|와촌면|자인면|용성면|남산면|남천면|중앙동|동부동|서부1동|서부2동|남부동|북부동|중방동|군위군|군위읍|소보면|효령면|부계면|우보면|의흥면|산성면|고로면|의성군|의성읍|단촌면|점곡면|옥산면|사곡면|춘산면|가음면|금성면|봉양면|비안면|구천면|단밀면|단북면|안계면|다인면|신평면|안평면|안사면|청송군|청송읍|주왕산면|부남면|현동면|현서면|안덕면|파천면|진보면|영양군|영양읍|입암면|청기면|일월면|수비면|석보면|영덕군|영덕읍|강구면|남정면|달산면|지품면|축산면|영해면|병곡면|창수면|청도군|청도읍|화양읍|각남면|풍각면|각북면|이서면|운문면|금천면|매전면|고령군|대가야읍|덕곡면|운수면|성산면|다산면|개진면|우곡면|쌍림면|성주군|성주읍|선남면|용암면|수륜면|가천면|금수면|대가면|벽진면|초전면|월항면|칠곡군|왜관읍|북삼읍|석적읍|지천면|동명면|가산면|약목면|기산면|예천군|예천읍|용문면|효자면|감천면|보문면|호명면|유천면|용궁면|개포면|지보면|풍양면|봉화군|봉화읍|물야면|봉성면|법전면|춘양면|소천면|석포면|재산면|명호면|상운면|울진군|울진읍|평해읍|북면|금강송면|근남면|매화면|기성면|온정면|죽변면|후포면|울릉군|울릉읍|서면|북면)") ## 경상북도
        self.connection.rpush("@sys.location", "(경상남도|경남|창원시|의창구|동읍|북면|대산면|의창동|팔룡동|명곡동|봉림동|용지동|성산구|반송동|중앙동|상남동|사파동|가음정동|성주동|웅남동|마산합포구|구산면|진동면|진북면|진전면|현동|가포동|월영동|문화동|반월중앙동|완월동|자산동|교방동|오동동|합포동|산호동|마산회원구|내서읍|회원1동|회원2동|석전동|회성동|양덕1동|양덕2동|합성1동|합성2동|구암1동|구암2동|봉암동|진해구|충무동|여좌동|태백동|경화동|병암동|석동|이동동|자은동|덕산동|풍호동|웅천동|웅동1동|웅동2동|웅동동|진주시|문산읍|내동면|정촌면|금곡면|진성면|일반성면|이반성면|사봉면|지수면|대곡면|금산면|집현면|미천면|명석면|대평면|수곡면|천전동|성북동|중앙동|상봉동|상대동|하대동|상평동|초장동|평거동|신안동|이현동|판문동|가호동|충무공동|통영시|산양읍|용남면|도산면|광도면|욕지면|한산면|사량면|도천동|명정동|중앙동|정량동|북신동|무전동|미수동|봉평동|사천시|사천읍|정동면|사남면|용현면|축동면|곤양면|곤명면|서포면|동서동|선구동|동서금동|벌용동|향촌동|남양동|김해시|진영읍|주촌면|진례면|한림면|생림면|상동면|대동면|동상동|회현동|부원동|내외동|북부동|칠산서부동|활천동|삼안동|불암동|장유1동|장유2동|장유3동|밀양시|삼랑진읍|하남읍|부북면|상동면|산외면|산내면|단장면|상남면|초동면|무안면|청도면|내일동|내이동|교동|삼문동|가곡동|거제시|일운면|동부면|남부면|거제면|둔덕면|사등면|연초면|하청면|장목면|장승포동|능포동|아주동|옥포1동|옥포2동|장평동|고현동|상문동|수양동|양산시|물금읍|동면|원동면|상북면|하북면|중앙동|양주동|삼성동|강서동|서창동|소주동|평산동|덕계동|의령군|의령읍|가례면|칠곡면|대의면|화정면|용덕면|정곡면|지정면|낙서면|부림면|봉수면|궁류면|유곡면|함안군|가양읍|칠원읍|함안면|군북면|법수면|대산면|칠서면|칠북면|산인면|여향면|창녕군|창녕읍|남지읍|고암면|성산면|대합면|이방면|유어면|대지면|계성면|영산면|장아면|도천면|길곡면|부곡면|고성군|고성읍|삼산면|하일면|하이면|상리면|대가면|영현면|영오면|개천면|구만면|회화면|마암면|동해면|거류면|남해군|남해읍|이동면|상주면|삼동면|미조면|남면|서면|고현면|설천면|창선면|하동군|하동읍|화개면|악양면|적량면|횡천면|고전면|금남면|금성면|진교면|양보면|북천면|청암면|옥종면|산청군|산청읍|차황면|오부면|생초면|금서면|삼장면|시천면|단성면|신안면|생비량면|신등면|함양군|함양읍|마천면|휴천면|유림면|수동면|지곡면|안의면|서하면|서상면|백전면|병곡면|거창군|거창읍|주상면|웅양면|고제면|북상면|위천면|마리면|남상면|남하면|신원면|가조면|가북면|합천군|합천읍|봉산면|묘산면|가야면|야로면|율곡면|초계면|쌍책면|덕곡면|청덕면|적중면|대양면|쌍백면|삼가면|가회면|대병면|용주면)") ## 경상남도
        self.connection.rpush("@sys.location", "(제주특별자치도|제주도|제주|제주시|한림읍|애월읍|구좌읍|조천읍|한경면|추자면|우도면|일도1동|일도2동|이도1동|이도2동|삼도1동|삼도2동|용담1동|용담2동|건입동|화북동|삼양동|봉개동|아라동|오라동|연동|노형동|외도동|이호동|도두동|서귀포시|대정읍|남원읍|성산읍|안덕면|표선면|송산동|정방동|중앙동|천지동|효돈동|영천동|동홍동|서홍동|대륜동|대천동|중문동|예래동)") ## 제주특별자치도
        self.connection.rpush("@sys.nation", "(아랍에미리트|아프카니스탄|알바니아|아르메니아|앙골라|아르헨티나|오스트레일리아|키리바시|코코넛\s*제도|나우루|투발루|아루바|아제르바이잔|보스니아\s*헤르체코비나|바베이도스|방글라데쉬|불가리아|바레인|브룬디|버뮤다|브루나이|싱가폴|볼리비아|브라질|바하마|부탄|보츠와나|벨라루스|벨리즈|캐나다|콩고\s*킨샤사|리크텐슈타인|스위스|칠레|중국|콜롬비아|코스타리카|쿠바|카보 베르데|체코\s*공화국|지부티|덴마크|도미니카\s*공화국|알제리아|이집트|에리트레아|에디오피아|아크로티리\s*데켈리아|안도라|오스트리아|벨기에|사이프러스|에스토니아|핀란드|프랑스|독일|그리스|아일랜드|이태리|코소보|라트비아|리투아니아|룩셈부르크|몰타|모나코|몬테네그로|네덜란드|포르투갈|산마리노|슬로바키아|슬로베니아|프레인|바티칸|피지|포크랜드\s*제도|올더니섬|영국령\s*인도양\s*식민지|대영국|영국|메인\s*섬|조지아|남오세티아|가나|지브롤터|잠비아|기니아|과테말라|과야나|홍콩|온두라스|크로아티아|아이티|헝가리|인도네시아|이스라엘|팔레스타인|부탄|인도|이라크|이란|아이슬랜드|자메이카|요르단|일본|케냐|키르키스탄|캄보디아|북한|남한|대한민국|쿠웨이트|케이맨제도|카자흐스탄|라오스|레바논|스리랑카|리베리아|레소토|리비야|모로코|몰도바|마다가스카드|마케도니아|미얀마|버마|몽골|마카오|모리타니|모리셔스|몰디브|말라위|멕시코|말레이시아|모잠비크|나미비야|나이지리아|니카라과|노르웨이|네팔|쿡\s*제도|쿡|뉴질랜드|니우에섬|피트케언섬|오만|파나마|페루|파푸아뉴기니아|필리핀|파키스탄|폴란드|파라과이|카타르|루마니아|코소보|세르비아|러시아|남오세티아|르완다|사우디아라비야|솔로몬제도|세이셜|수단|스웨덴|부루나이|싱가폴|어센션\s*섬|헬레나|트리스탄\s*다쿠나|시레라 리온|소말리아|수리남|상투메\s*프린시페|시리아|스위스|태국|타지키스탄|투르크메니스탄|튀니지|통가|북사이프러스|터키|트리니아드\s*토바고|대만|탄자니아|우크라이나|우간다|미국령\s*사모아|영국령\s*인도양\s*식민지|영국령\s*버진제도|괌|아이티|마샬군도|미크로네시아|북마리아나섬|태평양\s*외딴섬|팔아우|파나마|푸에르토리코|터크스카이코스제도|미국|버진아일랜드|우루과이|우즈베키스탄|베네수엘라|베트남|바누아투|사모아|베냉|부르키나\s*파소|카메룬|중앙아프리카공화국|차드|콩고공화국|코트디부아르|적도기니|가봉|기니비사우|말리|니제르|세네갈|토고|앙귈라|앤티가 바부다|도미니카|그레나다|몬세라트산|세이트 키츠섬|세인트루시아|세인트\s*빈센트섬|프랑스령\s*폴리네시아|뉴칼레도니아|윌리스푸투나제도|예멘|레소토|나미비아|남아프리카|잠비아|짐바브웨|튀르키예|터키)")
        self.connection.rpush("@sys.currency.name", "(아랍에미리트\s*디르함|아프가니|렉|아르메니아\s*드람|콴자|아르헨티나\s*페소|오스트레일리아\s*달러|아루반\s*길더|플로린|아제르\s*바이잔\s*마나트|마커|바베이도스\s*달러|타카|불가리안\s*레프|바레인\s*디나르|브룬디\s*프랑|버뮤디안\s*달러|브루나이\s*달러|볼리비아노|브라질리안\s*레알|바하미안\s*달러|눌트럼|풀라|벨라루시안\s*루블|루블|벨리즈 달러|캐나디안\s*달러|콩고프랑|스위스\s*프랑|칠레니아 \s*페소|페소|위안|콜롬비안\s*페소|코스타리칸\s*콜론|쿠반\s*페소|카보\s*베르데\s*에스쿠도|체코\s*코루나|지부티\s*프랑|덴마크\s*크로네|도미니칸\s*페소|알제르\s*디나르|이집트\s*파운드|파운드\s*낙파|에디오피안\s*비르|유로|피지\s*달러|포크랜드\s*제도\s*파운드|영국\s*파운드|라리|세디|지브롤터\s*파운드|달라시|기니아\s*프랑|케트살|괴야나\s*달러|홍콩\s*달러|렘피라|크로아티안\s*쿠나|구르드|포린트|루피아|새\s*이스라엘\s*셰켈|인디안\s*루피|이라크\s*디나르|이라니안\s*리알|아이슬랜드\s*크로나|자메이칸\s*달러|요르단\s*디나르|옌|케냐\s*실링|섬|릴|원|쿠웨이트\s*디나르|케이맨제도\s*달러|텡게|킵|레바논\s*파운드|스리랑카\s*루피|리베리아\s*달러|로티|리비야\s*디나르|모로코\s*디르함|몰도바\s*레우|마다가스카르\s*아리아|데나르|차트|투그리크|파타카|우기야|모리셔스\s*루피|루피야|콰차|멕시코\s*페소|말레이시아\s*링겟|메티칼|나미비야\s*달러|나이라|코르도바|노르웨이\s*크로네|네팔\s*루피|뉴질랜드\s*달러|리알\s*오마니|발보아|누에보\s*솔|키나|필리핀\s*페소|파키스타\s*루피|P즐로티|과라니|카타르\s*리알|레우|세르비아\s*디나르|러시아\s*루블|르완다\s*프랑|사우디\s*리알|솔로몬제도\s*달러|세이셸\s*루피|수단\s*파운드|스웨덴\s*크로나|싱가폴\s*달러|세인트\s*헬레나\s*파운드|리온|소말리아\s*실링|수리나\s*달러|도르바|시리아\s*파운드|리랑게니|바트|소모니|마나트|튀니지\s*디나르|파앙가|터키리라|트리니아드\s*토바고\s*달러|대만달러|탄자니아\s*실링|흐리브냐|우간다\s*실링|US\s*달러|달러|우루과이\s*페소|페소|리라|우즈베키스탄\s*금액|볼리바르|동|바투|탈라|CFA\s*프랑\s*BCEAO|프랑|동카리브\s*달러|동카리브\s*달러|CFP\s*프랑|예멘\s*리알|란드|잠비아\s*크와차|잠브웨이\s*달러|프랑|페소)")
        self.connection.rpush("@sys.currency.code", "(AED|AFN|ALL|AMD|AOA|ARS|AUD|AWG|AZN|BAM|BBD|BDT|BGN|BHD|BIF|BMD|BND|BOB|BRL|BSD|BTN|BWP|BYN|BZD|CAD|CDF|CHF|CLP|CNY|COP|CRC|CUP|CVE|CZK|DJF|DKK|DOP|DZD|EGP|ERN|ETB|EUR|FJD|FKP|GBP|GEL|GHS|GIP|GMD|GNF|GTQ|GYD|HKD|HNL|HRK|HTG|HUF|IDR||ILS|INR|IQD|IRR|ISK|JMD|JOD|JPY|KES|KGS|KHR|KPW|KRW|KWD|KYD|KZT|LAK|LBP|LKR|LRD|LSL|LYD|MAD|MDL|MGA|MKD|MMK|MNT|MOP|MRU|MUR|MVR|MWK|MXN|MYR|MZN|NAD|NGN|NIO|NOK|NPR|NZD|OMR|PAB|PEN|PGK|PHP|PKR|PLN|PYG|QAR|RON|RSD|RUB|SCR|SDG|SEK|SGD|SHP|SLL|SOS|SRD|STN|SYP|SZL|THB|TJS|TMT|TND|TOP|TRY|TTD|TWD|TZS|UAH|UGX|USD|UYU|UZS|VEF|VND|VUV|WST|XAF|XCD|XPF|XPF|XPF|YER|ZAR|ZAR|ZAR|ZMW|ZWL)")
        self.connection.rpush("@sys.unit.currency", "[0-9]+\s*(아랍에미리트\s*디르함|디르함|아프가니|렉|아르메니아\s*드람|드람|콴자|아르헨티나\s*페소|페소|오스트레일리아\s*달러|아루반\s*길더|플로린|달러|우루과이\s*페소|페소|리라|우즈베키스탄\s*금액|볼리바르|동|바투|탈라|CFA\s*프랑\s*BCEAO|프랑|동카리브\s*달러|동카리브\s*달러|CFP\s*프랑|예멘\s*리알|리알|란드|잠비아\s*크와차|잠브웨이\s*달러|프랑|페소|아제르\s*바이잔\s*마나트|마나트|마커|바베이도스\s*달러|타카|불가리안\s*레프|바레인\s*디나르|디나르|브룬디\s*프랑|버뮤디안\s*달러|브루나이\s*달러|볼리비아노|브라질리안\s*레알|레알|바하미안\s*달러|눌트럼|풀라|벨라루시안\s*루블|루블|벨리즈 달러|캐나디안\s*달러|콩고프랑|스위스\s*프랑|칠레니아 \s*페소|페소|위안|콜롬비안\s*페소|코스타리칸\s*콜론|쿠반\s*페소|카보\s*베르데\s*에스쿠도|체코\s*코루나|지부티\s*프랑|덴마크\s*크로네|크로네|도미니칸\s*페소|알제르\s*디나르|디나르|이집트\s*파운드|파운드|파운드\s*낙파|에디오피안\s*비르|유로|피지\s*달러|포크랜드\s*제도\s*파운드|영국\s*파운드|라리|세디|지브롤터\s*파운드|달라시|기니아\s*프랑|케트살|괴야나\s*달러|홍콩\s*달러|렘피라|크로아티안\s*쿠나|구르드|포린트|루피아|새\s*이스라엘\s*셰켈|인디안\s*루피|이라크\s*디나르|이라니안\s*리알|아이슬랜드\s*크로나|자메이칸\s*달러|요르단\s*디나르|옌|케냐\s*실링|섬|릴|원|쿠웨이트\s*디나르|케이맨제도\s*달러|텡게|킵|레바논\s*파운드|스리랑카\s*루피|리베리아\s*달러|로티|리비야\s*디나르|모로코\s*디르함|몰도바\s*레우|마다가스카르\s*아리아|데나르|차트|투그리크|파타카|우기야|모리셔스\s*루피|루피야|콰차|멕시코\s*페소|말레이시아\s*링겟|메티칼|나미비야\s*달러|나이라|코르도바|노르웨이\s*크로네|네팔\s*루피|뉴질랜드\s*달러|리알\s*오마니|발보아|누에보\s*솔|키나|필리핀\s*페소|루피|파키스타\s*루피|P즐로티|과라니|카타르\s*리알|레우|세르비아\s*디나르|러시아\s*루블|르완다\s*프랑|사우디\s*리알|리알|솔로몬제도\s*달러|세이셸\s*루피|수단\s*파운드|스웨덴\s*크로나|싱가폴\s*달러|세인트\s*헬레나\s*파운드|리온|소말리아\s*실링|수리나\s*달러|도르바|시리아\s*파운드|리랑게니|바트|소모니|마나트|튀니지\s*디나르|파앙가|터키리라|트리니아드\s*토바고\s*달러|대만달러|탄자니아\s*실링|흐리브냐|우간다\s*실링|실링|US\s*달러){1}")


    
    # 정규표현식 전달 메소드
    def find_loop(self):      
        # Redis 사용
        self.redis_key = [["@sys.city", 2], ["@sys.state", 123], ["@sys.location", 17], ["@sys.nation", 1], ["@sys.currency.name", 1], ["@sys.currency.code", 1], ["@sys.unit.currency", 1]]
        for i in self.redis_key:
            for now in self.connection.lrange(i[0], 0, i[1]):
                self.find_regex(i[0], now.decode("UTF-8"))

        # Redis 미사용
        for i in entity_list:
            self.now_entity_name = i[0]
            self.now_regex = i[1]

            self.find_regex(self.now_entity_name, self.now_regex)


    # 정규표현식 찾기
    def find_regex(self, entity_name, now_regex):
        # 정규표현식과 일치하는 문자열의 객체 주소 전달, finditer로 하면 result list에 object로 저장
        # finditer에 첫 번째 인자에 정규표현식이 들어가게 됨. Redis의 Key값을 끌고 오는 방향성으로 가자

        self.result = re.finditer(now_regex, self.sentence)
        for i in self.result:
            # 무효 데이터 처리
            if((i.group() == '') | (i.group() == ' ')):
                continue

            # list ver.
            self.entity_name.append(entity_name)
            self.value.append(i.group())
            self.start_idx.append(i.start())
            self.end_idx.append(i.end() - 1) # end_idx 리턴 값이 열린 구간으로 반환됨
            self.total_idx.append(self.cnt)

            self.cnt += 1

            '''
            # not list ver.
            self.entity_name = '@sys.unit.temperature'
            self.value = i.group()
            self.start_idx = i.start()
            self.end_idx = i.end() - 1
            '''


    # 개체명 찾기 (re 모듈을 이용한 정규표현식 구현 부분)
    def get_entity_name(self):
        
        return self.entity_name


    # 해당되는 값 찾기
    def get_value(self):
        if self.entity_name == '@sys.date':
            self.value = re.sub('[년월]\s?', '-', self.value)
            self.value = re.sub('일\s?', ' 00:00:00', self.value)

        
        return self.value


    # 시작 인덱스 찾기
    def get_start_idx(self):
        
        return self.start_idx


    # 마지막 인덱스 찾기
    def get_end_idx(self):
        
        return self.end_idx


    # 해당 문장 변환
    def get_tagged_sentence(self):
        '''
        # not list ver.
        # start_idx와 end_idx, entity_name 변수 가지고와서 slicing 또는 새로운 변수 정의하는 방식으로 tagged_sentence 만들기
        self.tagged_sentence = self.sentence[0:self.start_idx] + self.entity_name + self.sentence[self.end_idx + 1:]
        '''

        # list ver.
        self.new = list(zip(self.total_idx, self.value))
        self.new.sort(key = lambda x : len(x[1]), reverse = True)
        for word in self.new:
            self.sentence = re.sub(word[1], self.entity_name[word[0]], self.sentence)
            self.tagged_sentence = self.sentence

        return self.tagged_sentence


if __name__ == '__main__' :
    pass
